{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠĠ": 257,
      "ĠĠĠĠ": 258,
      "in": 259,
      "ĠĠĠ": 260,
      "int": 261,
      "de": 262,
      "ĊĠĠĠĠ": 263,
      "Ġ=": 264,
      "st": 265,
      "ĊĠĠĠ": 266,
      "Ġi": 267,
      "Ġ<": 268,
      ");": 269,
      "re": 270,
      "def": 271,
      "or": 272,
      "Ġ(": 273,
      "Ċĉ": 274,
      "on": 275,
      "ine": 276,
      "Ġc": 277,
      "ĠĠĠĠĠĠĠĠ": 278,
      "define": 279,
      "Ġl": 280,
      "ĊĠĠĠĠĠĠĠ": 281,
      "Ġa": 282,
      "Ġ{": 283,
      "Ġm": 284,
      "se": 285,
      "Ġf": 286,
      "Ġn": 287,
      "Ġp": 288,
      "++": 289,
      "Ġ1": 290,
      "00": 291,
      "cl": 292,
      "Ġ0": 293,
      "Ġ}": 294,
      "ou": 295,
      "ur": 296,
      "en": 297,
      "Ġs": 298,
      "Ġint": 299,
      "()": 300,
      "clu": 301,
      "inclu": 302,
      "include": 303,
      "ret": 304,
      "ll": 305,
      "**": 306,
      "Ġv": 307,
      "Ġ<<": 308,
      "urn": 309,
      "return": 310,
      "std": 311,
      "--": 312,
      "ĠĠĠĠĠĠĠ": 313,
      "Ġ+": 314,
      "Ġ>": 315,
      "ong": 316,
      "//": 317,
      "..": 318,
      "Ċĉĉ": 319,
      "out": 320,
      "it": 321,
      "Ġt": 322,
      "Ġb": 323,
      "Ġfor": 324,
      "Ġif": 325,
      "ĊĠĠĠĠĠĠĠĠĠĠĠ": 326,
      "Ġ-": 327,
      "ac": 328,
      "Ġ\"": 329,
      "am": 330,
      "Ġlong": 331,
      "<<": 332,
      "];": 333,
      "at": 334,
      "][": 335,
      "Ġd": 336,
      "er": 337,
      "ing": 338,
      "con": 339,
      "ns": 340,
      "yp": 341,
      "ir": 342,
      "Ġx": 343,
      "us": 344,
      "Ġreturn": 345,
      "if": 346,
      "le": 347,
      "++)": 348,
      "ct": 349,
      "Ġ&": 350,
      "end": 351,
      "\",": 352,
      "typ": 353,
      "Ġma": 354,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠ": 355,
      "(\"": 356,
      "ĊĠ": 357,
      "Ġ*": 358,
      "al": 359,
      "id": 360,
      "KK": 361,
      "ame": 362,
      "ect": 363,
      "ar": 364,
      "){": 365,
      "ector": 366,
      "mp": 367,
      "****": 368,
      "iz": 369,
      "__": 370,
      "ize": 371,
      "Ġll": 372,
      "Ġ>>": 373,
      "type": 374,
      "Ġstd": 375,
      "::": 376,
      "Ġj": 377,
      "Ġr": 378,
      "0000": 379,
      "].": 380,
      "op": 381,
      "==": 382,
      "str": 383,
      "ĠT": 384,
      "const": 385,
      "ue": 386,
      "os": 387,
      "ma": 388,
      "Ġcout": 389,
      "Ġ==": 390,
      "Ġe": 391,
      "typedef": 392,
      "air": 393,
      "an": 394,
      "for": 395,
      "WW": 396,
      "();": 397,
      "nt": 398,
      "ol": 399,
      "EE": 400,
      "Ġans": 401,
      "Ġcin": 402,
      "Ġre": 403,
      "ĊĊ": 404,
      "size": 405,
      "using": 406,
      "hi": 407,
      "ace": 408,
      "ack": 409,
      "ti": 410,
      "Ġ'": 411,
      "sp": 412,
      "lse": 413,
      ">>": 414,
      "Ġy": 415,
      "Ġname": 416,
      "od": 417,
      "ut": 418,
      "Ġ2": 419,
      "io": 420,
      "emp": 421,
      "space": 422,
      "##": 423,
      "----": 424,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 425,
      "Ċĉĉĉ": 426,
      "ate": 427,
      "string": 428,
      "Ġu": 429,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 430,
      "eg": 431,
      "Ġnamespace": 432,
      "],": 433,
      "))": 434,
      "(\"%": 435,
      "oid": 436,
      "Ġk": 437,
      "back": 438,
      "endl": 439,
      "ush": 440,
      "Ġw": 441,
      "Ġ;": 442,
      "um": 443,
      "....": 444,
      "Ġg": 445,
      "set": 446,
      "ĊĊĠĠĠ": 447,
      "ĠM": 448,
      "Ġmain": 449,
      "as": 450,
      "âĸ": 451,
      "])": 452,
      "egin": 453,
      "Ġvector": 454,
      "Ġ%": 455,
      "irst": 456,
      "hile": 457,
      "begin": 458,
      "bit": 459,
      "Ġ<=": 460,
      "ans": 461,
      "LL": 462,
      "ble": 463,
      "Ġin": 464,
      "ow": 465,
      "cout": 466,
      "vector": 467,
      "Ġ,": 468,
      "stre": 469,
      "can": 470,
      "empl": 471,
      "stream": 472,
      "Ġ++": 473,
      "cond": 474,
      "!=": 475,
      "********": 476,
      "second": 477,
      "ith": 478,
      "Ġpr": 479,
      "emplate": 480,
      "ch": 481,
      "DD": 482,
      "ii": 483,
      "ouble": 484,
      "Ġpair": 485,
      "cin": 486,
      "]=": 487,
      "xt": 488,
      "bits": 489,
      "<<\"": 490,
      "stdio": 491,
      "++.": 492,
      "Ġ+=": 493,
      "stdc": 494,
      "pr": 495,
      "canf": 496,
      "Ġ//": 497,
      "]);": 498,
      "Ġelse": 499,
      "Ġ)": 500,
      "Ġ&&": 501,
      "ase": 502,
      "Ġcon": 503,
      "tie": 504,
      "KKKK": 505,
      "ĊĠĠĠĠĠ": 506,
      "<=": 507,
      "void": 508,
      "template": 509,
      "ed": 510,
      "),": 511,
      "(),": 512,
      "ve": 513,
      "\";": 514,
      "ig": 515,
      "++;": 516,
      "ool": 517,
      "pair": 518,
      "Ġ:": 519,
      "ĠF": 520,
      "intf": 521,
      "88": 522,
      "ĠN": 523,
      "ename": 524,
      "ass": 525,
      "et": 526,
      "Ġendl": 527,
      "Ġres": 528,
      "nc": 529,
      "Ġ|": 530,
      "));": 531,
      "Ġ/": 532,
      "Ġwhile": 533,
      "is": 534,
      "Ġq": 535,
      "Ġmod": 536,
      "alse": 537,
      "push": 538,
      "IN": 539,
      "¿½": 540,
      "ï¿½": 541,
      "ator": 542,
      "ĠA": 543,
      "Ġdouble": 544,
      "ync": 545,
      "im": 546,
      "with": 547,
      "line": 548,
      "erator": 549,
      "ad": 550,
      "Ġ!=": 551,
      "Ġmax": 552,
      "sync": 553,
      "open": 554,
      "Ġscanf": 555,
      ").": 556,
      "ĠS": 557,
      "Ġo": 558,
      "10": 559,
      "ode": 560,
      "reopen": 561,
      "--------": 562,
      "max": 563,
      "ke": 564,
      "ĠP": 565,
      "first": 566,
      "rt": 567,
      "nd": 568,
      "put": 569,
      "EEEE": 570,
      "Ġconst": 571,
      "else": 572,
      "...": 573,
      "â£": 574,
      "////": 575,
      "pb": 576,
      "ree": 577,
      "WWWW": 578,
      "Ġar": 579,
      "Ġop": 580,
      "++){": 581,
      "ï¿½ï¿½": 582,
      "Ġch": 583,
      "Ġtr": 584,
      "Ġfirst": 585,
      "####": 586,
      "uto": 587,
      "MM": 588,
      ";}": 589,
      "Ġdp": 590,
      "Ġ__": 591,
      "Ġit": 592,
      "base": 593,
      "())": 594,
      "long": 595,
      "ag": 596,
      "OD": 597,
      "=(": 598,
      "Ġ_": 599,
      "Ġpush": 600,
      "Ġmin": 601,
      "Ġ>=": 602,
      "Ġ3": 603,
      "Ġh": 604,
      "AX": 605,
      "ĠR": 606,
      "typename": 607,
      "ot": 608,
      "Ġcnt": 609,
      "ic": 610,
      "que": 611,
      "ul": 612,
      "Ġprintf": 613,
      "........": 614,
      "ĠĠĠĠĠ": 615,
      "bool": 616,
      "char": 617,
      "Ġst": 618,
      "em": 619,
      "cnt": 620,
      "Ġ#": 621,
      "class": 622,
      "};": 623,
      "ist": 624,
      "dp": 625,
      "Ġsecond": 626,
      "of": 627,
      "____": 628,
      "un": 629,
      "((": 630,
      "Ġios": 631,
      "00000000": 632,
      "map": 633,
      ";;": 634,
      "ĉĉ": 635,
      "Ġval": 636,
      "while": 637,
      "Ġpb": 638,
      "';": 639,
      "ĊĠĠ": 640,
      "es": 641,
      "sert": 642,
      "tin": 643,
      "Ġmake": 644,
      "ast": 645,
      "mod": 646,
      "ort": 647,
      "txt": 648,
      "ĠL": 649,
      "64": 650,
      "Ġvoid": 651,
      "auto": 652,
      "Ġmp": 653,
      "****************": 654,
      "om": 655,
      "err": 656,
      "false": 657,
      ",,": 658,
      "ion": 659,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 660,
      "+=": 661,
      "ign": 662,
      "--)": 663,
      "fs": 664,
      "â£¿": 665,
      "')": 666,
      "olve": 667,
      "ck": 668,
      "(){": 669,
      "GG": 670,
      "âĸĳ": 671,
      "Ġ\"<<": 672,
      "inline": 673,
      "cur": 674,
      "Ġsz": 675,
      "bu": 676,
      "ak": 677,
      "ĠMOD": 678,
      "min": 679,
      "res": 680,
      "Ġ((": 681,
      "Ġ||": 682,
      "ĠD": 683,
      "val": 684,
      "tr": 685,
      "000": 686,
      "ĠC": 687,
      "====": 688,
      "Ġget": 689,
      ">=": 690,
      "Ġde": 691,
      "ĠG": 692,
      "DDDD": 693,
      "\",&": 694,
      "pp": 695,
      "il": 696,
      "Ġsum": 697,
      "());": 698,
      "Ġtyp": 699,
      "Ġall": 700,
      "Ġoperator": 701,
      "\");": 702,
      "Ġcur": 703,
      "orde": 704,
      "ap": 705,
      "pos": 706,
      "INF": 707,
      "ge": 708,
      "OR": 709,
      "11": 710,
      "]==": 711,
      "cd": 712,
      "ind": 713,
      "ount": 714,
      "--;": 715,
      "node": 716,
      ",-": 717,
      "Ġstring": 718,
      "igned": 719,
      "ĠI": 720,
      "Ġld": 721,
      "endif": 722,
      "ext": 723,
      "\")": 724,
      "tinue": 725,
      "Ġtrue": 726,
      "ath": 727,
      "arr": 728,
      "reak": 729,
      "iostream": 730,
      "queue": 731,
      "lld": 732,
      "lo": 733,
      "ime": 734,
      "8888": 735,
      "Ġpii": 736,
      "Ġfreopen": 737,
      "ĠB": 738,
      "Ġsize": 739,
      "->": 740,
      "MAX": 741,
      "]]": 742,
      "sum": 743,
      "Ġmid": 744,
      "he": 745,
      "Ġmem": 746,
      "Ġto": 747,
      "freopen": 748,
      "Ġad": 749,
      "Ġz": 750,
      "âĸĳâĸĳ": 751,
      "tim": 752,
      "EP": 753,
      "ithm": 754,
      "â£¿â£¿": 755,
      "gor": 756,
      "Ċĉĉĉĉ": 757,
      "pd": 758,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 759,
      "gorithm": 760,
      "Ġbool": 761,
      "Ġ\";": 762,
      "âĸĪ": 763,
      "Ġ?": 764,
      "99": 765,
      "ds": 766,
      "Ġfalse": 767,
      "algorithm": 768,
      "Ġsolve": 769,
      "Ġarr": 770,
      "scanf": 771,
      "tree": 772,
      "Ġse": 773,
      "ver": 774,
      "Ġ'\\": 775,
      "len": 776,
      "all": 777,
      "printf": 778,
      "gs": 779,
      "nsigned": 780,
      "cm": 781,
      "]-": 782,
      "num": 783,
      "double": 784,
      "Ġrep": 785,
      "ĠĠĠĠĠĠ": 786,
      "bs": 787,
      "ĊĊĠĠĠĠĠĠĠ": 788,
      "ĠINF": 789,
      "ent": 790,
      "ix": 791,
      "Ġ100000000": 792,
      "ower": 793,
      "agma": 794,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 795,
      "pragma": 796,
      "KKKKKKKK": 797,
      "////////": 798,
      "ES": 799,
      "pop": 800,
      "get": 801,
      "th": 802,
      "Ġtypename": 803,
      "NO": 804,
      "Ġout": 805,
      "&&": 806,
      "Ġstdin": 807,
      "pre": 808,
      "est": 809,
      "Ġret": 810,
      "Ġ10": 811,
      "Ġsort": 812,
      "AR": 813,
      "Ġ5": 814,
      "Ġcl": 815,
      "sz": 816,
      "*(": 817,
      "ĠLL": 818,
      "ostream": 819,
      "Ġchar": 820,
      "Ġis": 821,
      "red": 822,
      "ff": 823,
      "Ġdfs": 824,
      "Ġunsigned": 825,
      "Ġ7": 826,
      "to": 827,
      "++--": 828,
      "]+": 829,
      "Ġpos": 830,
      "Ġinf": 831,
      "Ġvi": 832,
      "ĠFOR": 833,
      "(!": 834,
      "----------------": 835,
      "ub": 836,
      "Ġ-=": 837,
      "omp": 838,
      "Ġ(!": 839,
      "fr": 840,
      ")%": 841,
      "++--++--": 842,
      "ld": 843,
      "ay": 844,
      "ĠV": 845,
      "Ġcontinue": 846,
      "ound": 847,
      "Ġset": 848,
      "ULL": 849,
      "Ġ\\": 850,
      "mx": 851,
      "Ġcerr": 852,
      "Ġinline": 853,
      "ios": 854,
      "oint": 855,
      "MMMM": 856,
      "ĊĉĊ": 857,
      "Ġ);": 858,
      "/*": 859,
      "count": 860,
      "ft": 861,
      "ĠGC": 862,
      "Ġmemset": 863,
      "ull": 864,
      "input": 865,
      "32": 866,
      "Ġtree": 867,
      "\",\"": 868,
      "Ġos": 869,
      "Ġbreak": 870,
      "Ġid": 871,
      "ex": 872,
      ")(": 873,
      "ifdef": 874,
      "ht": 875,
      "pdate": 876,
      "########": 877,
      ");}": 878,
      "ĠĠĠĠĠĠĠĠĠ": 879,
      "sk": 880,
      "ĠGCC": 881,
      "ps": 882,
      "Ġgcd": 883,
      "ĠO": 884,
      "ss": 885,
      "',": 886,
      "insert": 887,
      "Ġ4": 888,
      "ordered": 889,
      "Ġ--": 890,
      "âĸĪâĸĪ": 891,
      "Ġmx": 892,
      "cmath": 893,
      "Ġ\"\\": 894,
      "ĠMAX": 895,
      "âĸĴ": 896,
      "53": 897,
      "vi": 898,
      "Ġpre": 899,
      "ï¿½ï¿½ï¿½ï¿½": 900,
      "ta": 901,
      "li": 902,
      "Ġfi": 903,
      "Ġstr": 904,
      "18": 905,
      "*/": 906,
      ")/": 907,
      "ight": 908,
      "\"<<": 909,
      "mid": 910,
      "15": 911,
      "GS": 912,
      "idx": 913,
      "cstdio": 914,
      "Ġ1000000007": 915,
      "100": 916,
      "Ġfr": 917,
      "and": 918,
      "Ġ\",": 919,
      "stack": 920,
      "Ġclass": 921,
      ",&": 922,
      "Ġnum": 923,
      "ro": 924,
      "Ġstdout": 925,
      "bug": 926,
      "Ġlen": 927,
      "26": 928,
      "art": 929,
      "pii": 930,
      "NULL": 931,
      "fi": 932,
      "now": 933,
      "YES": 934,
      "________": 935,
      "uct": 936,
      "Ġadd": 937,
      "sizeof": 938,
      "10000": 939,
      "ip": 940,
      "ĊĠĠĠĠĠĠĠĠ": 941,
      "Ġread": 942,
      "................": 943,
      "ĠPI": 944,
      "ce": 945,
      "ax": 946,
      "bound": 947,
      "EEEEEEEE": 948,
      "[]": 949,
      "ĠU": 950,
      "ost": 951,
      "sed": 952,
      "========": 953,
      "ty": 954,
      "Ġ]": 955,
      "(-": 956,
      "//#": 957,
      "fl": 958,
      "Ġpll": 959,
      "ĊĊĊĊ": 960,
      ">&": 961,
      "'.": 962,
      "ity": 963,
      "ĠAr": 964,
      "hpp": 965,
      "ĊĠĠĠĠĊĠĠĠ": 966,
      "14": 967,
      "...)": 968,
      "output": 969,
      "12": 970,
      "@@": 971,
      "vis": 972,
      "ARGS": 973,
      "oc": 974,
      "]++;": 975,
      "uer": 976,
      "Ġpi": 977,
      "Ġoptim": 978,
      "ment": 979,
      "ĠĠĠĠĠĠĠĠĠĠ": 980,
      "eck": 981,
      "MAXN": 982,
      "sse": 983,
      "SE": 984,
      "ite": 985,
      ";;;;": 986,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 987,
      "ĠX": 988,
      "are": 989,
      "Ġ.": 990,
      "({": 991,
      "VA": 992,
      "cstring": 993,
      "his": 994,
      "ĠE": 995,
      "order": 996,
      "Ġull": 997,
      "Ġtmp": 998,
      "uery": 999,
      "Ġ!": 1000,
      "ĠREP": 1001,
      "âĸĴâĸĴ": 1002,
      "OC": 1003,
      "Ġoptimize": 1004,
      ";++": 1005,
      "ec": 1006,
      "Ġtemplate": 1007,
      "iterator": 1008,
      "wap": 1009,
      "Ġmap": 1010,
      "********************************": 1011,
      "act": 1012,
      "Ġac": 1013,
      "20": 1014,
      ",,,,": 1015,
      "erase": 1016,
      "ĊĊĠ": 1017,
      "ĊĠĠĠĠĠĠ": 1018,
      "Ġsq": 1019,
      "Ġmul": 1020,
      "ction": 1021,
      "Ġ[": 1022,
      "Ġne": 1023,
      "Ġle": 1024,
      "Ġss": 1025,
      "().": 1026,
      "stdin": 1027,
      "Ġ10000": 1028,
      "verse": 1029,
      ">(": 1030,
      "});": 1031,
      "Ġsizeof": 1032,
      "::::": 1033,
      "Ġput": 1034,
      "]){": 1035,
      "abs": 1036,
      "');": 1037,
      "Ġii": 1038,
      "Ġ*/": 1039,
      "Ġdebug": 1040,
      "up": 1041,
      "INE": 1042,
      "assert": 1043,
      "WWWWWWWW": 1044,
      "ĊĠĠĠĠĠĠĠĠĠ": 1045,
      "MOD": 1046,
      "struct": 1047,
      "33": 1048,
      "tmp": 1049,
      "lib": 1050,
      ">,": 1051,
      "ont": 1052,
      "97": 1053,
      "buil": 1054,
      "Ġvalue": 1055,
      "sort": 1056,
      "empty": 1057,
      "cerr": 1058,
      "rep": 1059,
      "Ġnode": 1060,
      "LINE": 1061,
      "ep": 1062,
      "gn": 1063,
      "man": 1064,
      "Ġbu": 1065,
      "GGGG": 1066,
      "Ġtemp": 1067,
      "unordered": 1068,
      "Ġvis": 1069,
      "Ġeps": 1070,
      "Ġthe": 1071,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1072,
      "stdlib": 1073,
      "///": 1074,
      "Ġauto": 1075,
      "stat": 1076,
      "Ġof": 1077,
      "cle": 1078,
      "Ċĉĉĉĉĉ": 1079,
      "maxn": 1080,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1081,
      "DG": 1082,
      "]=='": 1083,
      "update": 1084,
      "ata": 1085,
      "âķ": 1086,
      "prec": 1087,
      "az": 1088,
      "time": 1089,
      "DDDDDDDD": 1090,
      "ision": 1091,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1092,
      "front": 1093,
      "','.": 1094,
      "Ġand": 1095,
      "Ġ*=": 1096,
      "ĊĊĉ": 1097,
      "atr": 1098,
      "1000": 1099,
      "Ġex": 1100,
      "Ġsc": 1101,
      "ok": 1102,
      "clo": 1103,
      "<<'": 1104,
      "Ġ%=": 1105,
      "bitset": 1106,
      "Ġlo": 1107,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1108,
      ")-": 1109,
      "Ġarg": 1110,
      "<<(": 1111,
      "precision": 1112,
      "Ġdist": 1113,
      "24": 1114,
      ")+": 1115,
      "WWW": 1116,
      "find": 1117,
      "Ġend": 1118,
      "Int": 1119,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 1120,
      "ult": 1121,
      "Ġmn": 1122,
      "////////////////": 1123,
      "gcd": 1124,
      "ioman": 1125,
      "iomanip": 1126,
      "88888888": 1127,
      "]={": 1128,
      "Ġ(\"": 1129,
      "Ġ^": 1130,
      "(...)": 1131,
      "mem": 1132,
      ">;": 1133,
      "âĸĢ": 1134,
      "âł": 1135,
      "ore": 1136,
      "Ġadj": 1137,
      "mn": 1138,
      "Ġabs": 1139,
      "(__": 1140,
      "++--++--++--++--": 1141,
      "58": 1142,
      "Ġacos": 1143,
      "Ġ1000": 1144,
      "gth": 1145,
      "stdout": 1146,
      "â£¿â£¿â£¿â£¿": 1147,
      "Ġok": 1148,
      "(_": 1149,
      "ab": 1150,
      "Ġ\"<<#": 1151,
      "unction": 1152,
      "resize": 1153,
      "Ġinclude": 1154,
      "Ġdb": 1155,
      "EEE": 1156,
      "JU": 1157,
      "one": 1158,
      ")*": 1159,
      "ER": 1160,
      "break": 1161,
      "<<\"\\": 1162,
      "Ġlast": 1163,
      "atrix": 1164,
      "AL": 1165,
      "Ġfast": 1166,
      "DGE": 1167,
      "top": 1168,
      "JUDGE": 1169,
      "NLINE": 1170,
      "Ġvec": 1171,
      "<(": 1172,
      "vec": 1173,
      "pper": 1174,
      "builtin": 1175,
      "Ġbase": 1176,
      "Ġ6": 1177,
      "ange": 1178,
      "EB": 1179,
      "dist": 1180,
      "ĠH": 1181,
      "159": 1182,
      "its": 1183,
      "Ġ';": 1184,
      "cstdlib": 1185,
      "temp": 1186,
      "Ġdefine": 1187,
      "list": 1188,
      "continue": 1189,
      "Ġostream": 1190,
      "rand": 1191,
      ")*(": 1192,
      "arent": 1193,
      "14159": 1194,
      "Ġcom": 1195,
      "mask": 1196,
      "comp": 1197,
      "dfs": 1198,
      "ptr": 1199,
      "clock": 1200,
      "1415926": 1201,
      ")<<": 1202,
      "Ġ/=": 1203,
      "rite": 1204,
      "--){": 1205,
      "||": 1206,
      "dex": 1207,
      "this": 1208,
      "xx": 1209,
      "lock": 1210,
      "ndef": 1211,
      "ead": 1212,
      "KKK": 1213,
      "Ġtype": 1214,
      "rr": 1215,
      "In": 1216,
      "name": 1217,
      "Ġfl": 1218,
      "Ġas": 1219,
      "par": 1220,
      "ie": 1221,
      "â¢": 1222,
      "','.','.": 1223,
      "Ġth": 1224,
      "gnu": 1225,
      "Max": 1226,
      "add": 1227,
      "ash": 1228,
      "43": 1229,
      "ess": 1230,
      "Ġcheck": 1231,
      "Ġgo": 1232,
      "args": 1233,
      "ĠONLINE": 1234,
      "âĸĦ": 1235,
      "ST": 1236,
      "à¦": 1237,
      "ifndef": 1238,
      "âĸĳâĸĳâĸĳâĸĳ": 1239,
      "rbegin": 1240,
      "Ġpar": 1241,
      "tag": 1242,
      "Ġidx": 1243,
      "ĊĊĊ": 1244,
      "deque": 1245,
      "iner": 1246,
      "true": 1247,
      "]!=": 1248,
      "Ġswap": 1249,
      "Ġtot": 1250,
      "tainer": 1251,
      "22": 1252,
      "Ġhi": 1253,
      "clear": 1254,
      "141592653": 1255,
      "Ġdx": 1256,
      "EPS": 1257,
      "ĠMAXN": 1258,
      ">::": 1259,
      "('": 1260,
      "si": 1261,
      "Ġcomp": 1262,
      "Ġvv": 1263,
      "37": 1264,
      "ne": 1265,
      "ixed": 1266,
      "solve": 1267,
      "ior": 1268,
      "Ġdy": 1269,
      "sstream": 1270,
      "MMMMMMMM": 1271,
      "},": 1272,
      "Ġfind": 1273,
      "30": 1274,
      "Ġff": 1275,
      "50": 1276,
      "Ġquery": 1277,
      "]*": 1278,
      "col": 1279,
      "ctime": 1280,
      "Ġdi": 1281,
      "azy": 1282,
      "lex": 1283,
      "iority": 1284,
      "pl": 1285,
      "Ġputs": 1286,
      "Ġsh": 1287,
      "OCAL": 1288,
      "SEC": 1289,
      "Ġed": 1290,
      "length": 1291,
      "Ġnow": 1292,
      "UG": 1293,
      "ĠY": 1294,
      "Ġun": 1295,
      "di": 1296,
      "Ġbit": 1297,
      "Ġ){": 1298,
      "<<\":": 1299,
      "ĠK": 1300,
      "pbds": 1301,
      "-=": 1302,
      "55": 1303,
      "cc": 1304,
      "istream": 1305,
      "################": 1306,
      "function": 1307,
      "(),(": 1308,
      "AC": 1309,
      "container": 1310,
      "/=": 1311,
      "fast": 1312,
      "ink": 1313,
      "00005": 1314,
      "pow": 1315,
      "tt": 1316,
      "Ġprint": 1317,
      "Ġ};": 1318,
      "ics": 1319,
      "null": 1320,
      "alc": 1321,
      "adj": 1322,
      "last": 1323,
      "aa": 1324,
      "Ġen": 1325,
      "Ġ100": 1326,
      "uti": 1327,
      "chr": 1328,
      "ĠLOCAL": 1329,
      "pll": 1330,
      "istics": 1331,
      "LE": 1332,
      "EBUG": 1333,
      "ber": 1334,
      "IO": 1335,
      "ation": 1336,
      "Ġupdate": 1337,
      "hs": 1338,
      "arget": 1339,
      "statistics": 1340,
      "Ġ++)": 1341,
      "assoc": 1342,
      "ng": 1343,
      "pol": 1344,
      "ĠIn": 1345,
      "av": 1346,
      "cassert": 1347,
      "ĠEPS": 1348,
      "Ġ9": 1349,
      "make": 1350,
      "Ġnext": 1351,
      "operator": 1352,
      "dd": 1353,
      "ĊĊĠĠĠĠĠĠĠĠĠĠĠ": 1354,
      ":.": 1355,
      "...);": 1356,
      "ĠĊ": 1357,
      "â¡": 1358,
      "ĠArgs": 1359,
      "left": 1360,
      "Ġcount": 1361,
      "<<\"=": 1362,
      "]-'": 1363,
      "16": 1364,
      "KKKKK": 1365,
      "__)": 1366,
      "row": 1367,
      "Ġargs": 1368,
      "38": 1369,
      "Ġstart": 1370,
      "el": 1371,
      "Ġ{}": 1372,
      "sub": 1373,
      "Ġcol": 1374,
      "gh": 1375,
      "popcount": 1376,
      "ono": 1377,
      "root": 1378,
      "Ġï¿½ï¿½ï¿½ï¿½": 1379,
      "<<#": 1380,
      "998": 1381,
      "Ġmaxn": 1382,
      "ĠArg": 1383,
      "Ġvll": 1384,
      "value": 1385,
      "=-": 1386,
      "Ġnxt": 1387,
      "Ġtarget": 1388,
      "14159265358": 1389,
      "Ġpoint": 1390,
      "Ġ\":": 1391,
      "rend": 1392,
      "polic": 1393,
      "=='": 1394,
      "Ġlower": 1395,
      "46": 1396,
      "inf": 1397,
      "It": 1398,
      "pt": 1399,
      "oot": 1400,
      "<<\"=\"<<": 1401,
      "Ġpower": 1402,
      "ive": 1403,
      "ĊĠĠĠĠĠĠĠĠĠĠ": 1404,
      "Ġseg": 1405,
      "Ġgetchar": 1406,
      "Ġbe": 1407,
      "Ġleft": 1408,
      "Ġ()": 1409,
      "lli": 1410,
      "Ġright": 1411,
      "ha": 1412,
      "]+=": 1413,
      "read": 1414,
      "lim": 1415,
      "Ġinit": 1416,
      "eric": 1417,
      "]));": 1418,
      "mt": 1419,
      "Ġsqr": 1420,
      "used": 1421,
      "ĠW": 1422,
      "1415926535897": 1423,
      "Ġnew": 1424,
      "99824": 1425,
      "Ġparent": 1426,
      "31": 1427,
      "56": 1428,
      "ĠĊĠĠĠ": 1429,
      "functional": 1430,
      "Ġgr": 1431,
      "lic": 1432,
      "FOR": 1433,
      "ild": 1434,
      "ME": 1435,
      "Size": 1436,
      "================": 1437,
      "9982443": 1438,
      "Ġscan": 1439,
      "14159265358979": 1440,
      "998244353": 1441,
      "ype": 1442,
      "ary": 1443,
      "()-": 1444,
      "Ġforn": 1445,
      "ĠQ": 1446,
      ")))": 1447,
      "policy": 1448,
      "tot": 1449,
      "ĊĉĠĠĠ": 1450,
      "wer": 1451,
      "Ġhe": 1452,
      "iff": 1453,
      "1111": 1454,
      "34": 1455,
      "Ġnull": 1456,
      "Ġless": 1457,
      "Ġpow": 1458,
      "@@@@": 1459,
      "]];": 1460,
      "<<\"=\"<<(": 1461,
      "expr": 1462,
      "Ġind": 1463,
      "Ġreverse": 1464,
      "Ġ...": 1465,
      "mul": 1466,
      "Ġvii": 1467,
      "typeof": 1468,
      "Ġ->": 1469,
      "seg": 1470,
      "ges": 1471,
      "Ġrb": 1472,
      "ĠSZ": 1473,
      "hild": 1474,
      "lf": 1475,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1476,
      "]].": 1477,
      "Ġusing": 1478,
      "RE": 1479,
      "ero": 1480,
      "Ġused": 1481,
      "ĊĠĠĠĠĉ": 1482,
      "Ġsp": 1483,
      "--------------------------------": 1484,
      "UT": 1485,
      "Ġfact": 1486,
      "Ġresult": 1487,
      "Ġyou": 1488,
      "ublic": 1489,
      "next": 1490,
      "inv": 1491,
      "INT": 1492,
      "ique": 1493,
      "chrono": 1494,
      "[]={": 1495,
      "Ġ>>=": 1496,
      "Ġpf": 1497,
      "ĠIO": 1498,
      "Ġfrom": 1499,
      "nxt": 1500,
      "Ġpop": 1501,
      "numeric": 1502,
      "Ġbuild": 1503,
      "Ġmy": 1504,
      "-'": 1505,
      "low": 1506,
      "Ġroot": 1507,
      "sc": 1508,
      "(\"-": 1509,
      "Ġassert": 1510,
      "com": 1511,
      "]>": 1512,
      "77": 1513,
      "KKKKKKKKKKKKKKKK": 1514,
      "Ġ/*": 1515,
      "right": 1516,
      "199": 1517,
      "point": 1518,
      "qu": 1519,
      "fstream": 1520,
      "Ġtest": 1521,
      "RT": 1522,
      "go": 1523,
      "Ġpriority": 1524,
      "Ġor": 1525,
      "âĸĪâĸĪâĸĪâĸĪ": 1526,
      "ĊĉĉĊĉ": 1527,
      "]<<\"": 1528,
      "start": 1529,
      "1415926535897932": 1530,
      "Ġinv": 1531,
      "ater": 1532,
      "+(": 1533,
      "ĉĉĉ": 1534,
      "flag": 1535,
      "FF": 1536,
      ",;": 1537,
      "]--;": 1538,
      "II": 1539,
      "]))": 1540,
      "link": 1541,
      "check": 1542,
      "Ġfixed": 1543,
      "ob": 1544,
      "Ġ::": 1545,
      "Ġsub": 1546,
      "imes": 1547,
      "Ġsol": 1548,
      "Ġmask": 1549,
      "ove": 1550,
      "lace": 1551,
      "aph": 1552,
      "Ġon": 1553,
      "Matrix": 1554,
      "nullptr": 1555,
      "orm": 1556,
      "uple": 1557,
      "no": 1558,
      "sq": 1559,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1560,
      "lement": 1561,
      "%=": 1562,
      "pi": 1563,
      "Ġtrace": 1564,
      "fact": 1565,
      "ular": 1566,
      "ĊĉĠ": 1567,
      "reater": 1568,
      "main": 1569,
      "data": 1570,
      "math": 1571,
      "01": 1572,
      "(*": 1573,
      "ĠMod": 1574,
      "edge": 1575,
      "Ġupper": 1576,
      ")){": 1577,
      "bb": 1578,
      "Ġsqrt": 1579,
      "test": 1580,
      "ah": 1581,
      "Ġrem": 1582,
      "dis": 1583,
      "141592653589793238": 1584,
      "]<": 1585,
      "Ġlcm": 1586,
      "200": 1587,
      "PER": 1588,
      "ail": 1589,
      "ros": 1590,
      "Ġdep": 1591,
      "uff": 1592,
      "MP": 1593,
      "Ġemp": 1594,
      "signed": 1595,
      "Ġdo": 1596,
      "+=(": 1597,
      "Ġat": 1598,
      "prime": 1599,
      ",(": 1600,
      "Mod": 1601,
      "Ġcan": 1602,
      "Ġflag": 1603,
      "Node": 1604,
      "19937": 1605,
      "RO": 1606,
      "Ġvvi": 1607,
      ",+": 1608,
      "REP": 1609,
      "-(": 1610,
      "(\"\\": 1611,
      "puts": 1612,
      "Ġwrite": 1613,
      "Ġdis": 1614,
      "Ġ998244353": 1615,
      "Ġcost": 1616,
      "OCK": 1617,
      "memset": 1618,
      "LOCK": 1619,
      "Ġlow": 1620,
      "Ġmd": 1621,
      "()){": 1622,
      "*=": 1623,
      "gr": 1624,
      "14159265358979323846": 1625,
      "IT": 1626,
      "Ġpref": 1627,
      "Ġpq": 1628,
      "]][": 1629,
      "Ġtypedef": 1630,
      "Ġ31": 1631,
      "dig": 1632,
      "Ġsetprecision": 1633,
      "No": 1634,
      "________________": 1635,
      "ĠDEBUG": 1636,
      "Ġ8": 1637,
      "âĸĴâĸĴâĸĴâĸĴ": 1638,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1639,
      "unique": 1640,
      "able": 1641,
      "atch": 1642,
      "dge": 1643,
      "'){": 1644,
      "ILE": 1645,
      "Ġms": 1646,
      "swap": 1647,
      "100005": 1648,
      "++--++--++--++--++--++--++--++--": 1649,
      "Ġclock": 1650,
      "Ġprime": 1651,
      "per": 1652,
      "âĸĢâĸĢ": 1653,
      "Ġ20": 1654,
      "LOCKS": 1655,
      "ON": 1656,
      "exp": 1657,
      "yy": 1658,
      "[(": 1659,
      "getchar": 1660,
      "Ġpa": 1661,
      "79": 1662,
      "uint": 1663,
      "48": 1664,
      "Ġordered": 1665,
      "MX": 1666,
      "pa": 1667,
      "public": 1668,
      "ark": 1669,
      "00000": 1670,
      "iii": 1671,
      "Ġuint": 1672,
      "vv": 1673,
      "ĠALL": 1674,
      "oo": 1675,
      "Ġvs": 1676,
      "sin": 1677,
      "rem": 1678,
      "ĊĊĊĠĠĠ": 1679,
      "ill": 1680,
      "~~": 1681,
      "]=(": 1682,
      "loop": 1683,
      "query": 1684,
      "Ġxx": 1685,
      "Ġpt": 1686,
      "Ġup": 1687,
      "******": 1688,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1689,
      "Point": 1690,
      "]]++;": 1691,
      "&(": 1692,
      "Ġbegin": 1693,
      "19": 1694,
      "100000000": 1695,
      "eger": 1696,
      "Ġque": 1697,
      "Ġmulti": 1698,
      "ited": 1699,
      "Ġ'<<": 1700,
      "be": 1701,
      "tion": 1702,
      "Ġcomment": 1703,
      "Val": 1704,
      "Ġerr": 1705,
      "Ġ),": 1706,
      "500": 1707,
      "avx": 1708,
      "odd": 1709,
      "cost": 1710,
      "lity": 1711,
      "17": 1712,
      "DE": 1713,
      "WK": 1714,
      ",_": 1715,
      "hash": 1716,
      "har": 1717,
      "jj": 1718,
      "ative": 1719,
      ")<<\",": 1720,
      "from": 1721,
      "index": 1722,
      ")));": 1723,
      "vl": 1724,
      "ly": 1725,
      "och": 1726,
      "Ġpw": 1727,
      "ory": 1728,
      "Ofast": 1729,
      "linker": 1730,
      "ave": 1731,
      "complex": 1732,
      "ven": 1733,
      ");++": 1734,
      "Ġver": 1735,
      "dep": 1736,
      "ang": 1737,
      "):": 1738,
      "epoch": 1739,
      "since": 1740,
      "Ġ(((": 1741,
      "curr": 1742,
      "Ġexit": 1743,
      "random": 1744,
      "Ġ\"/": 1745,
      "]),": 1746,
      "23": 1747,
      "req": 1748,
      "////////////////////////////////": 1749,
      "-')": 1750,
      "GGGGGGGG": 1751,
      "wo": 1752,
      "Ġbin": 1753,
      "/**": 1754,
      "sh": 1755,
      "write": 1756,
      "ach": 1757,
      "su": 1758,
      "Ġpp": 1759,
      "Ġdbg": 1760,
      "Ġiter": 1761,
      "arg": 1762,
      "Ġthis": 1763,
      "Ġanswer": 1764,
      "++]": 1765,
      "mark": 1766,
      "Ġ100000": 1767,
      "MatrixSize": 1768,
      "Ġsf": 1769,
      "Ġrall": 1770,
      "utility": 1771,
      "Ġcalc": 1772,
      "100000": 1773,
      ">>(": 1774,
      "]])": 1775,
      "acro": 1776,
      "our": 1777,
      "Ġbest": 1778,
      "ĠIOS": 1779,
      "substr": 1780,
      "),(": 1781,
      "Ġ^=": 1782,
      "59": 1783,
      "Ġ///": 1784,
      "28": 1785,
      "lazy": 1786,
      "Ġtm": 1787,
      "stead": 1788,
      "Ġke": 1789,
      "own": 1790,
      "Ġinput": 1791,
      "Iterator": 1792,
      "heap": 1793,
      "MaxMatrixSize": 1794,
      "âĸĮ": 1795,
      "Ġneed": 1796,
      "AS": 1797,
      "Ġ++;": 1798,
      "Ġstat": 1799,
      "Ġcmp": 1800,
      "Ġno": 1801,
      "Ġdata": 1802,
      "init": 1803,
      "Pos": 1804,
      "ca": 1805,
      "Time": 1806,
      "vel": 1807,
      "array": 1808,
      "ĊĊĊĊĊĊĊĊ": 1809,
      "lower": 1810,
      "Ġprev": 1811,
      "Ġ\")": 1812,
      ".....": 1813,
      "27": 1814,
      "Ġoo": 1815,
      "ĠPoint": 1816,
      "Ġlb": 1817,
      "Ġrhs": 1818,
      "stringstream": 1819,
      "rk": 1820,
      "Ġvl": 1821,
      "constexpr": 1822,
      "ĠInt": 1823,
      "Ġ30": 1824,
      "Ġyy": 1825,
      "Ġlli": 1826,
      "Ġaa": 1827,
      "sim": 1828,
      "60": 1829,
      "vs": 1830,
      "Ġ(*": 1831,
      "te": 1832,
      "Ġrng": 1833,
      "Ġputchar": 1834,
      "++,": 1835,
      "TES": 1836,
      "ross": 1837,
      "AT": 1838,
      "mat": 1839,
      "Char": 1840,
      "Ġ26": 1841,
      "names": 1842,
      "','.','.','.','.": 1843,
      "9999": 1844,
      "__,": 1845,
      "static": 1846,
      "ĊĊĠĠ": 1847,
      "new": 1848,
      "âķĲ": 1849,
      "steady": 1850,
      "ĠMax": 1851,
      "buf": 1852,
      "Ġ\"]": 1853,
      "iv": 1854,
      "Ġlazy": 1855,
      "................................": 1856,
      "co": 1857,
      "___": 1858,
      ")==": 1859,
      "ĠPII": 1860,
      "29": 1861,
      "Ġ'.": 1862,
      "Ġwh": 1863,
      "ms": 1864,
      "Ġtt": 1865,
      "memory": 1866,
      "------": 1867,
      "db": 1868,
      "Ġstatic": 1869,
      "CRT": 1870,
      "less": 1871,
      "emplace": 1872,
      "Case": 1873,
      "Count": 1874,
      "Ġemplace": 1875,
      "Ġtl": 1876,
      "URE": 1877,
      "Ġbig": 1878,
      "###": 1879,
      "Ġindex": 1880,
      "13": 1881,
      "erge": 1882,
      "KKKKKKK": 1883,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1884,
      "Ġnot": 1885,
      "ĠMP": 1886,
      "hor": 1887,
      "Yes": 1888,
      "Ġistream": 1889,
      "Ġmt": 1890,
      "key": 1891,
      "power": 1892,
      "ĠDB": 1893,
      "','": 1894,
      "Tree": 1895,
      "ays": 1896,
      "ust": 1897,
      "SECURE": 1898,
      "tex": 1899,
      "Ġdel": 1900,
      "\".": 1901,
      "ĠPB": 1902,
      ";.": 1903,
      "ord": 1904,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1905,
      "200005": 1906,
      "Ġrange": 1907,
      "Ġupd": 1908,
      "mi": 1909,
      "Ġfill": 1910,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1911,
      "Ġgc": 1912,
      "Ġcurr": 1913,
      "Ġrev": 1914,
      "file": 1915,
      "pref": 1916,
      "sol": 1917,
      "Ġan": 1918,
      "Ġfin": 1919,
      "tf": 1920,
      "Type": 1921,
      "Ġtime": 1922,
      "ance": 1923,
      "element": 1924,
      "Ġbuf": 1925,
      "Ġedge": 1926,
      "]]=": 1927,
      "iiii": 1928,
      "ice": 1929,
      "<=(": 1930,
      ">>=": 1931,
      "tuple": 1932,
      "loat": 1933,
      "loops": 1934,
      "(;": 1935,
      "Ġcc": 1936,
      "ĠĊĠĠĠĠĠĠĠ": 1937,
      "Ġnorm": 1938,
      "cr": 1939,
      "Ġby": 1940,
      "Ġsu": 1941,
      "Ġli": 1942,
      "Ġline": 1943,
      "sqrt": 1944,
      "################################": 1945,
      "))%": 1946,
      "AN": 1947,
      "âĸĦâĸĦ": 1948,
      "ĉĊ": 1949,
      "ALL": 1950,
      "nx": 1951,
      "Ġarray": 1952,
      "},{": 1953,
      "ter": 1954,
      "Ġsi": 1955,
      "Ġmark": 1956,
      "%%": 1957,
      "Ġinsert": 1958,
      "Ġexp": 1959,
      "Ġ\"[": 1960,
      "ard": 1961,
      "iend": 1962,
      "popcnt": 1963,
      "rime": 1964,
      "reverse": 1965,
      "Ġmk": 1966,
      "OF": 1967,
      "ĊĊĉĉ": 1968,
      "âĶ": 1969,
      "();}": 1970,
      "ĊĠĠĠĠĠĠĠĠĊĠĠĠĠĠĠĠ": 1971,
      "calc": 1972,
      "digit": 1973,
      "Ġco": 1974,
      "Ġ',": 1975,
      "ĠMX": 1976,
      "roll": 1977,
      "Edge": 1978,
      "tl": 1979,
      "SZ": 1980,
      "Ġps": 1981,
      "Out": 1982,
      "/********************************": 1983,
      "md": 1984,
      "unsigned": 1985,
      ")),": 1986,
      "cp": 1987,
      "Ġrr": 1988,
      "Ġ|=": 1989,
      "1010": 1990,
      "DDD": 1991,
      "Ġfile": 1992,
      "multi": 1993,
      "mmx": 1994,
      "ĠFI": 1995,
      "flush": 1996,
      "ssse": 1997,
      ";;;;;;;;": 1998,
      "unroll": 1999,
      "Ġ(;": 2000,
      "ial": 2001,
      "abm": 2002,
      "IZ": 2003,
      "ift": 2004,
      "GGG": 2005,
      "âĶĢ": 2006,
      "Min": 2007,
      "KE": 2008,
      "40": 2009,
      "pq": 2010,
      "ank": 2011,
      ",,,,,,,,": 2012,
      "arch": 2013,
      "Arr": 2014,
      "ln": 2015,
      "mall": 2016,
      "âķ¬": 2017,
      "FS": 2018,
      "high": 2019,
      "8888888888888888": 2020,
      "])%": 2021,
      "DDDDDDDDDDDD": 2022,
      "57": 2023,
      "]%": 2024,
      "NIN": 2025,
      "br": 2026,
      "best": 2027,
      "ARNIN": 2028,
      "Ġdepth": 2029,
      "ET": 2030,
      "Ġmi": 2031,
      "Ġrand": 2032,
      "WARNIN": 2033,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2034,
      "ls": 2035,
      "WARNINGS": 2036,
      "]<<": 2037,
      "TT": 2038,
      "clim": 2039,
      "Integer": 2040,
      "Ġpc": 2041,
      "une": 2042,
      "FILE": 2043,
      "Ġthrow": 2044,
      "Ġdiff": 2045,
      "der": 2046,
      "Ġnumber": 2047,
      "Ġiterator": 2048,
      "ution": 2049,
      "Ġfore": 2050,
      "Ġub": 2051,
      "WWWWWWW": 2052,
      "climits": 2053,
      ">=(": 2054,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2055,
      "St": 2056,
      ")?": 2057,
      "]>=": 2058,
      "=\"": 2059,
      "uthor": 2060,
      "flow": 2061,
      "limits": 2062,
      "fixed": 2063,
      "ra": 2064,
      "OUT": 2065,
      "setprecision": 2066,
      "AST": 2067,
      "\\\\": 2068,
      "Ġrow": 2069,
      "maxN": 2070,
      "Ġbs": 2071,
      "3456": 2072,
      "MMMMMMMMMMMMMMMM": 2073,
      "Ġone": 2074,
      "IZE": 2075,
      "!!": 2076,
      "à§": 2077,
      "Ġnames": 2078,
      "native": 2079,
      "Ġ');": 2080,
      "WWWWWW": 2081,
      "Line": 2082,
      "diff": 2083,
      "EEEEEEEEEEEE": 2084,
      "Ġ.,;": 2085,
      "**************": 2086,
      "Ġstruct": 2087,
      "mm": 2088,
      "â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿": 2089,
      "Ġedges": 2090,
      "by": 2091,
      "dx": 2092,
      "prev": 2093,
      "Ġ\"\";": 2094,
      "ĠFor": 2095,
      "EC": 2096,
      "â£¿â£": 2097,
      "tune": 2098,
      "Ġneg": 2099,
      "Ġtotal": 2100,
      "://": 2101,
      "onent": 2102,
      "use": 2103,
      "21": 2104,
      "]<=": 2105,
      "DEBUG": 2106,
      "Ġ32": 2107,
      "Ġgraph": 2108,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2109,
      "Ġ{-": 2110,
      "KKKKKK": 2111,
      "\"\"": 2112,
      "âĸĲ": 2113,
      "00010": 2114,
      "Ġper": 2115,
      "Ġrt": 2116,
      "Ġzero": 2117,
      "NN": 2118,
      "sible": 2119,
      "*-": 2120,
      "print": 2121,
      "Ġprimes": 2122,
      "<<'\\": 2123,
      "ik": 2124,
      "Ġ(__": 2125,
      "itr": 2126,
      "debug": 2127,
      "Ġare": 2128,
      "Ġ100005": 2129,
      "Ġhigh": 2130,
      "NU": 2131,
      "Ġdeb": 2132,
      "fj": 2133,
      "ctype": 2134,
      "Ġ(\"%": 2135,
      "âķ¬âķ¬": 2136,
      "ĠVI": 2137,
      "rc": 2138,
      "ĠCLOCKS": 2139,
      "ION": 2140,
      "forn": 2141,
      "Ġta": 2142,
      "Ġcomma": 2143,
      "ĠĊĉ": 2144,
      "ĠINT": 2145,
      "ACK": 2146,
      "25": 2147,
      "264": 2148,
      "Ġsync": 2149,
      "Ġ-*-": 2150,
      "â¢Ģ": 2151,
      ",\"": 2152,
      "head": 2153,
      "Ġbb": 2154,
      "101": 2155,
      "89": 2156,
      "111": 2157,
      "ĠInput": 2158,
      "obj": 2159,
      "ONG": 2160,
      ":::": 2161,
      "parent": 2162,
      "()))": 2163,
      "Ġgen": 2164,
      "Ġ~": 2165,
      "Ġal": 2166,
      "Ġhash": 2167,
      "']": 2168,
      ";--": 2169,
      "Ġqueue": 2170,
      "OG": 2171,
      "rint": 2172,
      "Ġ\"%": 2173,
      "47": 2174,
      "Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½": 2175,
      "onoid": 2176,
      "build": 2177,
      "(\"\");": 2178,
      ",.": 2179,
      "iter": 2180,
      "deg": 2181,
      "ĊĠĊĠ": 2182,
      "STACK": 2183,
      "Ġbo": 2184,
      "log": 2185,
      "Ġgreater": 2186,
      "Ġ1000000000": 2187,
      "ĠZ": 2188,
      "ask": 2189,
      "result": 2190,
      "PB": 2191,
      "ud": 2192,
      "rb": 2193,
      "Ġ.:": 2194,
      "Ġà¦": 2195,
      "<<-": 2196,
      "105": 2197,
      "Ġ\"(\"": 2198,
      "Ġrd": 2199,
      "Ġoutput": 2200,
      "child": 2201,
      "000000": 2202,
      "!=(": 2203,
      "Ġ'-')": 2204,
      "enter": 2205,
      "'s": 2206,
      "ry": 2207,
      "Ġwith": 2208,
      "big": 2209,
      "cy": 2210,
      "kk": 2211,
      "));}": 2212,
      "Ġmodular": 2213,
      "14159265358979323846264": 2214,
      "WKK": 2215,
      "Ġloop": 2216,
      "ĠPR": 2217,
      "âĸĵ": 2218,
      "fa": 2219,
      "Ġscani": 2220,
      "Ġlim": 2221,
      "49": 2222,
      "AME": 2223,
      "fac": 2224,
      "'||": 2225,
      "ĠNode": 2226,
      "Range": 2227,
      "rs": 2228,
      "@@@@@@@@": 2229,
      "bo": 2230,
      "maxi": 2231,
      "--,": 2232,
      "acos": 2233,
      "Ġel": 2234,
      "Ġcomplex": 2235,
      "['": 2236,
      "Ġmat": 2237,
      "popcountll": 2238,
      "DEEEE": 2239,
      "Ġnormal": 2240,
      "Ġwe": 2241,
      "(#": 2242,
      "ux": 2243,
      "ĊĠĠĠĠĊĠĠĠĠ": 2244,
      "priority": 2245,
      "Value": 2246,
      "ĊĠĠĠĠĉĉ": 2247,
      "(\"%.": 2248,
      "]='": 2249,
      "Ġhell": 2250,
      "67": 2251,
      "action": 2252,
      ")]": 2253,
      "[](": 2254,
      "_|": 2255,
      "Ġoth": 2256,
      "ces": 2257,
      "#####": 2258,
      "Ġsm": 2259,
      "af": 2260,
      ")&": 2261,
      ")<<\"": 2262,
      ",:": 2263,
      "ND": 2264,
      "ny": 2265,
      "Ċĉĉĉĉĉĉ": 2266,
      "po": 2267,
      "]],": 2268,
      "ain": 2269,
      "ĊĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2270,
      "1415926535897932384626433": 2271,
      "}}": 2272,
      "ded": 2273,
      "upper": 2274,
      "Ġ\"-": 2275,
      "WWWWWWWWW": 2276,
      "ĠJ": 2277,
      "Ġvpii": 2278,
      "Ġclr": 2279,
      "Ġdeg": 2280,
      "PII": 2281,
      "ire": 2282,
      "old": 2283,
      "greater": 2284,
      "ors": 2285,
      "Long": 2286,
      "ri": 2287,
      "Ġbfs": 2288,
      "**/": 2289,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉ": 2290,
      "Ġmaxi": 2291,
      "Ġeb": 2292,
      "Ġext": 2293,
      "tc": 2294,
      "Ġmacro": 2295,
      "ope": 2296,
      "OW": 2297,
      "......": 2298,
      "we": 2299,
      "âłĢ": 2300,
      "âĶĢâĶĢ": 2301,
      "Ġpath": 2302,
      "umber": 2303,
      "_(": 2304,
      "Ġct": 2305,
      "aken": 2306,
      "here": 2307,
      "80": 2308,
      "do": 2309,
      "Ġ`": 2310,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2311,
      "Ġcase": 2312,
      "mon": 2313,
      "ai": 2314,
      "NAME": 2315,
      "Str": 2316,
      "Ġtop": 2317,
      "Input": 2318,
      "ED": 2319,
      "neg": 2320,
      "__;": 2321,
      "blem": 2322,
      "edges": 2323,
      "Ġodd": 2324,
      "ition": 2325,
      "Ġchk": 2326,
      "Ġfriend": 2327,
      "****************************************************************": 2328,
      "ĠPT": 2329,
      "âĸĳâĸĳâĸĳ": 2330,
      "derr": 2331,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2332,
      "123": 2333,
      "ho": 2334,
      "visited": 2335,
      "rg": 2336,
      "ant": 2337,
      "000000000": 2338,
      "Ġvc": 2339,
      "();++": 2340,
      "Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½": 2341,
      "sm": 2342,
      "rev": 2343,
      ")((": 2344,
      "/(": 2345,
      "LI": 2346,
      "tm": 2347,
      "rent": 2348,
      "()),": 2349,
      "NOTES": 2350,
      "Ġunordered": 2351,
      "Ġorder": 2352,
      "ara": 2353,
      "qual": 2354,
      "cept": 2355,
      "CT": 2356,
      "Ġpl": 2357,
      "EM": 2358,
      "54": 2359,
      "Ġmerge": 2360,
      "ĊĠĊĠĠĠ": 2361,
      "Ġme": 2362,
      "Ġshift": 2363,
      "âķĲâķ": 2364,
      "&...": 2365,
      "cmp": 2366,
      "Ġ11": 2367,
      "()==": 2368,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2369,
      "ies": 2370,
      "pw": 2371,
      "ump": 2372,
      "ĠPrint": 2373,
      "::::::::": 2374,
      "sy": 2375,
      "}\";": 2376,
      ")<<\"\\": 2377,
      "namespace": 2378,
      "bl": 2379,
      "arry": 2380,
      "Ġnl": 2381,
      "Ġbr": 2382,
      "isdigit": 2383,
      "34567": 2384,
      "Ġother": 2385,
      "]]);": 2386,
      "cctype": 2387,
      "Ġ')": 2388,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2389,
      "ACRO": 2390,
      "fin": 2391,
      "Ġfac": 2392,
      ",,,": 2393,
      "Ġ\"]\";": 2394,
      "888": 2395,
      "ĠFAST": 2396,
      "ek": 2397,
      "Ġhtt": 2398,
      "mag": 2399,
      "Ġsec": 2400,
      "66": 2401,
      "PI": 2402,
      "Ġmodint": 2403,
      "14159265358979323846264338": 2404,
      "my": 2405,
      "Ġfo": 2406,
      "upd": 2407,
      "ĠSQ": 2408,
      "texs": 2409,
      "UN": 2410,
      "ĠÐ": 2411,
      "Ġdig": 2412,
      "Ġ][": 2413,
      "Ġpdd": 2414,
      "1000000007": 2415,
      "Ġmultiset": 2416,
      "â¢¿": 2417,
      "Ġwas": 2418,
      "Ġ>::": 2419,
      "Ġhead": 2420,
      ")>>": 2421,
      "TS": 2422,
      "Ġcross": 2423,
      "Ġ\"[\";": 2424,
      "1005": 2425,
      "ute": 2426,
      "Ġrnd": 2427,
      "path": 2428,
      ";;;": 2429,
      "ĠLINF": 2430,
      "bj": 2431,
      "rest": 2432,
      "oth": 2433,
      "Ġkey": 2434,
      "Iter": 2435,
      "tail": 2436,
      "multiset": 2437,
      "cs": 2438,
      "float": 2439,
      "hite": 2440,
      "Ġ];": 2441,
      "pro": 2442,
      "Ġvisited": 2443,
      "bad": 2444,
      "Ġtc": 2445,
      "ieve": 2446,
      "clz": 2447,
      "........................": 2448,
      "ear": 2449,
      "jk": 2450,
      "Ġmodul": 2451,
      ")<": 2452,
      "ĠVector": 2453,
      "disp": 2454,
      "unc": 2455,
      "imer": 2456,
      "39": 2457,
      "[++": 2458,
      "del": 2459,
      "Ġ12": 2460,
      "Ġlst": 2461,
      "Ġbound": 2462,
      "--------------": 2463,
      "nod": 2464,
      "Ġcont": 2465,
      "Child": 2466,
      "EK": 2467,
      "WWWWW": 2468,
      "ĠLD": 2469,
      "ww": 2470,
      "Ġfn": 2471,
      "Ġlevel": 2472,
      "Ġbinary": 2473,
      "Ġ&_": 2474,
      "Ġ(_": 2475,
      "need": 2476,
      "color": 2477,
      "Ġfabs": 2478,
      "ĠComp": 2479,
      "68": 2480,
      "cpp": 2481,
      "search": 2482,
      "0000000000": 2483,
      "ivate": 2484,
      "61": 2485,
      "wt": 2486,
      "ĠMin": 2487,
      "ĠMonoid": 2488,
      "Ġ\")\";": 2489,
      "ĠĊĠ": 2490,
      "Ġsign": 2491,
      "Ġvar": 2492,
      "exit": 2493,
      "âĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳ": 2494,
      "XX": 2495,
      "raction": 2496,
      "Ġnd": 2497,
      "Ġgood": 2498,
      "Ġloc": 2499,
      "Ġitr": 2500,
      "1000000": 2501,
      "100010": 2502,
      "1415926535897932384626433832": 2503,
      ")+(": 2504,
      "==-": 2505,
      "atcher": 2506,
      "Ġnx": 2507,
      "================================": 2508,
      "'\\": 2509,
      "Ans": 2510,
      "nn": 2511,
      "Ġsd": 2512,
