{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠĠ": 257,
      "ĠĠĠĠ": 258,
      "in": 259,
      "ĠĠĠ": 260,
      "int": 261,
      "de": 262,
      "ĊĠĠĠĠ": 263,
      "Ġ=": 264,
      "st": 265,
      "ĊĠĠĠ": 266,
      "Ġi": 267,
      "Ġ<": 268,
      ");": 269,
      "re": 270,
      "def": 271,
      "or": 272,
      "Ġ(": 273,
      "Ċĉ": 274,
      "on": 275,
      "ine": 276,
      "Ġc": 277,
      "define": 278,
      "Ġl": 279,
      "ĠĠĠĠĠĠĠĠ": 280,
      "ĊĠĠĠĠĠĠĠ": 281,
      "Ġa": 282,
      "Ġ{": 283,
      "Ġm": 284,
      "se": 285,
      "Ġf": 286,
      "Ġn": 287,
      "Ġp": 288,
      "++": 289,
      "Ġ1": 290,
      "00": 291,
      "cl": 292,
      "Ġ0": 293,
      "Ġ}": 294,
      "ou": 295,
      "ur": 296,
      "en": 297,
      "Ġs": 298,
      "Ġint": 299,
      "clu": 300,
      "inclu": 301,
      "include": 302,
      "()": 303,
      "ret": 304,
      "ll": 305,
      "**": 306,
      "Ġv": 307,
      "Ġ<<": 308,
      "std": 309,
      "urn": 310,
      "return": 311,
      "--": 312,
      "ĠĠĠĠĠĠĠ": 313,
      "Ġ+": 314,
      "Ġ>": 315,
      "..": 316,
      "//": 317,
      "ong": 318,
      "Ċĉĉ": 319,
      "out": 320,
      "it": 321,
      "Ġt": 322,
      "Ġb": 323,
      "Ġfor": 324,
      "Ġif": 325,
      "ĊĠĠĠĠĠĠĠĠĠĠĠ": 326,
      "Ġ-": 327,
      "Ġ\"": 328,
      "ac": 329,
      "am": 330,
      "Ġlong": 331,
      "<<": 332,
      "];": 333,
      "at": 334,
      "][": 335,
      "er": 336,
      "ing": 337,
      "Ġd": 338,
      "con": 339,
      "yp": 340,
      "ns": 341,
      "ir": 342,
      "Ġx": 343,
      "us": 344,
      "Ġreturn": 345,
      "if": 346,
      "le": 347,
      "++)": 348,
      "ct": 349,
      "Ġ&": 350,
      "end": 351,
      "\",": 352,
      "typ": 353,
      "Ġma": 354,
      "(\"": 355,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠ": 356,
      "Ġ*": 357,
      "ĊĠ": 358,
      "KK": 359,
      "al": 360,
      "id": 361,
      "ame": 362,
      "ect": 363,
      "ar": 364,
      "){": 365,
      "ector": 366,
      "mp": 367,
      "****": 368,
      "iz": 369,
      "ize": 370,
      "type": 371,
      "Ġll": 372,
      "::": 373,
      "Ġ>>": 374,
      "Ġstd": 375,
      "__": 376,
      "Ġj": 377,
      "0000": 378,
      "Ġr": 379,
      "ĠT": 380,
      "op": 381,
      "str": 382,
      "].": 383,
      "==": 384,
      "ue": 385,
      "const": 386,
      "os": 387,
      "ma": 388,
      "Ġcout": 389,
      "Ġe": 390,
      "Ġ==": 391,
      "typedef": 392,
      "air": 393,
      "WW": 394,
      "for": 395,
      "an": 396,
      "EE": 397,
      "();": 398,
      "nt": 399,
      "ol": 400,
      "Ġcin": 401,
      "Ġans": 402,
      "Ġre": 403,
      "ĊĊ": 404,
      "size": 405,
      "using": 406,
      "hi": 407,
      "ace": 408,
      "ack": 409,
      "ti": 410,
      "Ġ'": 411,
      "sp": 412,
      "lse": 413,
      ">>": 414,
      "Ġy": 415,
      "Ġname": 416,
      "io": 417,
      "od": 418,
      "##": 419,
      "ut": 420,
      "----": 421,
      "Ġ2": 422,
      "emp": 423,
      "Ċĉĉĉ": 424,
      "space": 425,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 426,
      "ate": 427,
      "string": 428,
      "Ġu": 429,
      "eg": 430,
      "Ġnamespace": 431,
      "],": 432,
      "))": 433,
      "(\"%": 434,
      "oid": 435,
      "back": 436,
      "Ġk": 437,
      "endl": 438,
      "ush": 439,
      "....": 440,
      "Ġw": 441,
      "Ġ;": 442,
      "um": 443,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 444,
      "Ġg": 445,
      "set": 446,
      "ĊĊĠĠĠ": 447,
      "Ġmain": 448,
      "ĠM": 449,
      "âĸ": 450,
      "as": 451,
      "egin": 452,
      "])": 453,
      "irst": 454,
      "Ġvector": 455,
      "Ġ%": 456,
      "hile": 457,
      "begin": 458,
      "bit": 459,
      "Ġ<=": 460,
      "ble": 461,
      "ans": 462,
      "LL": 463,
      "Ġin": 464,
      "cout": 465,
      "ow": 466,
      "vector": 467,
      "stre": 468,
      "Ġ,": 469,
      "can": 470,
      "empl": 471,
      "stream": 472,
      "Ġ++": 473,
      "cond": 474,
      "!=": 475,
      "********": 476,
      "ith": 477,
      "Ġpr": 478,
      "second": 479,
      "DD": 480,
      "emplate": 481,
      "ch": 482,
      "ii": 483,
      "ouble": 484,
      "Ġpair": 485,
      "cin": 486,
      "Ġ)": 487,
      "xt": 488,
      "bits": 489,
      "<<\"": 490,
      "stdio": 491,
      "pr": 492,
      "++.": 493,
      "stdc": 494,
      "Ġ+=": 495,
      "canf": 496,
      "Ġ//": 497,
      "]=": 498,
      "Ġelse": 499,
      "Ġ&&": 500,
      "Ġcon": 501,
      "KKKK": 502,
      "]);": 503,
      "ase": 504,
      "tie": 505,
      "ĊĠĠĠĠĠ": 506,
      "void": 507,
      "<=": 508,
      "template": 509,
      "ed": 510,
      "(),": 511,
      "),": 512,
      "ve": 513,
      "\";": 514,
      "++;": 515,
      "ig": 516,
      "pair": 517,
      "ool": 518,
      "intf": 519,
      "Ġ:": 520,
      "ass": 521,
      "ĠN": 522,
      "ename": 523,
      "ĠF": 524,
      "Ġendl": 525,
      "et": 526,
      "Ġres": 527,
      "nc": 528,
      "Ġ|": 529,
      "Ġ/": 530,
      "));": 531,
      "is": 532,
      "¿½": 533,
      "ï¿½": 534,
      "push": 535,
      "Ġwhile": 536,
      "IN": 537,
      "Ġmod": 538,
      "alse": 539,
      "Ġq": 540,
      "â£": 541,
      "erat": 542,
      "ĠA": 543,
      "Ġdouble": 544,
      "ync": 545,
      "im": 546,
      "with": 547,
      "ad": 548,
      "erator": 549,
      "line": 550,
      "Ġ!=": 551,
      "Ġmax": 552,
      "sync": 553,
      "open": 554,
      "Ġscanf": 555,
      "--------": 556,
      ").": 557,
      "ĠS": 558,
      "10": 559,
      "Ġo": 560,
      "reopen": 561,
      "88": 562,
      "ode": 563,
      "max": 564,
      "rt": 565,
      "ke": 566,
      "ĠP": 567,
      "first": 568,
      "EEEE": 569,
      "Ġconst": 570,
      "nd": 571,
      "else": 572,
      "put": 573,
      "...": 574,
      "WWWW": 575,
      "ï¿½ï¿½": 576,
      "////": 577,
      "pb": 578,
      "ree": 579,
      "Ġar": 580,
      "MM": 581,
      "++){": 582,
      "####": 583,
      "Ġop": 584,
      "Ġfirst": 585,
      "Ġch": 586,
      "Ġtr": 587,
      "uto": 588,
      ";}": 589,
      "Ġit": 590,
      "Ġdp": 591,
      "ag": 592,
      "base": 593,
      "())": 594,
      "Ġ__": 595,
      "Ġpush": 596,
      "OD": 597,
      "Ġ_": 598,
      "long": 599,
      "Ġ>=": 600,
      "=(": 601,
      "Ġmin": 602,
      "Ġh": 603,
      "AX": 604,
      "Ġcnt": 605,
      "ĠR": 606,
      "Ġ3": 607,
      "typename": 608,
      "ot": 609,
      "........": 610,
      "que": 611,
      "ic": 612,
      "Ġprintf": 613,
      "ul": 614,
      "Ġst": 615,
      "ĠĠĠĠĠ": 616,
      "char": 617,
      "bool": 618,
      "Ġ#": 619,
      "class": 620,
      "em": 621,
      "cnt": 622,
      "â£¿": 623,
      ";;": 624,
      "ist": 625,
      "};": 626,
      "dp": 627,
      "Ġsecond": 628,
      "of": 629,
      "un": 630,
      "((": 631,
      "Ġios": 632,
      "Ġval": 633,
      "00000000": 634,
      "map": 635,
      "ĊĠĠ": 636,
      "ĉĉ": 637,
      "Ġpb": 638,
      "while": 639,
      "';": 640,
      "es": 641,
      "sert": 642,
      "Ġmake": 643,
      "tin": 644,
      "txt": 645,
      "ast": 646,
      "ort": 647,
      "mod": 648,
      "ĠL": 649,
      ",,": 650,
      "64": 651,
      "om": 652,
      "Ġmp": 653,
      "auto": 654,
      "****************": 655,
      "err": 656,
      "____": 657,
      "Ġvoid": 658,
      "ion": 659,
      "âĸĳ": 660,
      "false": 661,
      "')": 662,
      "+=": 663,
      "fs": 664,
      "ign": 665,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 666,
      "--)": 667,
      "GG": 668,
      "olve": 669,
      "ck": 670,
      "(){": 671,
      "Ġ\"<<": 672,
      "cur": 673,
      "inline": 674,
      "min": 675,
      "ak": 676,
      "bu": 677,
      "Ġsz": 678,
      "res": 679,
      "ĠMOD": 680,
      "val": 681,
      "Ġ((": 682,
      "DDDD": 683,
      "tr": 684,
      "ĠD": 685,
      "Ġget": 686,
      "ĠG": 687,
      "Ġ||": 688,
      "000": 689,
      "Ġde": 690,
      "\",&": 691,
      "Ġtyp": 692,
      "pp": 693,
      "====": 694,
      "ĠC": 695,
      "il": 696,
      "Ġsum": 697,
      ">=": 698,
      "Ġall": 699,
      "());": 700,
      "11": 701,
      "Ġcur": 702,
      "Ġoperator": 703,
      "orde": 704,
      "\");": 705,
      "ap": 706,
      "â£¿â£¿": 707,
      "INF": 708,
      "]==": 709,
      "ind": 710,
      "pos": 711,
      "cd": 712,
      "node": 713,
      "OR": 714,
      "ge": 715,
      "ount": 716,
      ",-": 717,
      "--;": 718,
      "ĠI": 719,
      "igned": 720,
      "Ġstring": 721,
      "Ġld": 722,
      "\")": 723,
      "endif": 724,
      "ext": 725,
      "tinue": 726,
      "Ġsize": 727,
      "ath": 728,
      "lo": 729,
      "lld": 730,
      "iostream": 731,
      "Ġtrue": 732,
      "queue": 733,
      "reak": 734,
      "arr": 735,
      "âĸĳâĸĳ": 736,
      "Ġfreopen": 737,
      "ime": 738,
      "Ġpii": 739,
      "ĠB": 740,
      "sum": 741,
      "MAX": 742,
      "]]": 743,
      "he": 744,
      "Ġmid": 745,
      "Ċĉĉĉĉ": 746,
      "Ġmem": 747,
      "Ġad": 748,
      "Ġto": 749,
      "freopen": 750,
      "ithm": 751,
      "tim": 752,
      "gor": 753,
      "EP": 754,
      "->": 755,
      "Ġz": 756,
      "pd": 757,
      "gorithm": 758,
      "âĸĪ": 759,
      "Ġ?": 760,
      "Ġ\";": 761,
      "99": 762,
      "Ġbool": 763,
      "algorithm": 764,
      "Ġsolve": 765,
      "ds": 766,
      "Ġarr": 767,
      "Ġfalse": 768,
      "scanf": 769,
      "ver": 770,
      "len": 771,
      "Ġ'\\": 772,
      "tree": 773,
      "all": 774,
      "printf": 775,
      "Ġse": 776,
      "gs": 777,
      "double": 778,
      "nsigned": 779,
      "bs": 780,
      "cm": 781,
      "ĠĠĠĠĠĠ": 782,
      "ĊĊĠĠĠĠĠĠĠ": 783,
      "]-": 784,
      "ĠINF": 785,
      "ent": 786,
      "Ġrep": 787,
      "ix": 788,
      "KKKKKKKK": 789,
      "num": 790,
      "Ġ100000000": 791,
      "Ġtypename": 792,
      "agma": 793,
      "pragma": 794,
      "Ġout": 795,
      "ower": 796,
      "pop": 797,
      "ES": 798,
      "////////": 799,
      "th": 800,
      "NO": 801,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 802,
      "Ġstdin": 803,
      "&&": 804,
      "Ġret": 805,
      "get": 806,
      "pre": 807,
      "est": 808,
      "Ġcl": 809,
      "8888": 810,
      "Ġ10": 811,
      "AR": 812,
      "Ġchar": 813,
      "Ġis": 814,
      "*(": 815,
      "Ġsort": 816,
      "ostream": 817,
      "ĠLL": 818,
      "to": 819,
      "red": 820,
      "Ġunsigned": 821,
      "Ġ5": 822,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 823,
      "Ġdfs": 824,
      "sz": 825,
      "----------------": 826,
      "Ġ);": 827,
      "Ġinf": 828,
      "++--": 829,
      "Ġpos": 830,
      "ff": 831,
      "omp": 832,
      "Ġ7": 833,
      "ĠFOR": 834,
      "Ġvi": 835,
      "ay": 836,
      "(!": 837,
      "fr": 838,
      "MMMM": 839,
      "ub": 840,
      "Ġ-=": 841,
      "++--++--": 842,
      ")%": 843,
      "Ġ(!": 844,
      "ĠV": 845,
      "Ġcontinue": 846,
      "/*": 847,
      "ld": 848,
      "Ġinline": 849,
      "Ġset": 850,
      "ULL": 851,
      "ound": 852,
      "ios": 853,
      "ĊĉĊ": 854,
      "Ġcerr": 855,
      "mx": 856,
      "]+": 857,
      "ĠGC": 858,
      "ft": 859,
      "oint": 860,
      "32": 861,
      "count": 862,
      "Ġmemset": 863,
      "input": 864,
      "Ġ\\": 865,
      "Ġos": 866,
      "ull": 867,
      "\",\"": 868,
      "Ġtree": 869,
      "Ġid": 870,
      ")(": 871,
      "########": 872,
      "Ġbreak": 873,
      "pdate": 874,
      "ht": 875,
      "ĠĠĠĠĠĠĠĠĠ": 876,
      "ex": 877,
      "ifdef": 878,
      "sk": 879,
      ");}": 880,
      "ĠGCC": 881,
      "insert": 882,
      "Ġgcd": 883,
      "ss": 884,
      "ĠO": 885,
      "ps": 886,
      "ordered": 887,
      "âĸĪâĸĪ": 888,
      "Ġ--": 889,
      "Ġ\"\\": 890,
      "ï¿½ï¿½ï¿½ï¿½": 891,
      "53": 892,
      "cmath": 893,
      "Ġmx": 894,
      "âĸĴ": 895,
      "Ġstr": 896,
      "ĠMAX": 897,
      "vi": 898,
      "Ġ4": 899,
      "Ġpre": 900,
      "li": 901,
      "idx": 902,
      "18": 903,
      "ta": 904,
      "*/": 905,
      "Ġfi": 906,
      "15": 907,
      "\"<<": 908,
      "100": 909,
      "ight": 910,
      ")/": 911,
      "GS": 912,
      "cstdio": 913,
      "Ġclass": 914,
      "and": 915,
      "Ġfr": 916,
      "mid": 917,
      "Ġ1000000007": 918,
      "Ġ\",": 919,
      "stack": 920,
      ",&": 921,
      "Ġnum": 922,
      "Ġstdout": 923,
      "ro": 924,
      "Ġlen": 925,
      "bug": 926,
      "art": 927,
      "26": 928,
      "pii": 929,
      "ĊĠĠĠĠĠĠĠĠ": 930,
      "YES": 931,
      "NULL": 932,
      "................": 933,
      "ip": 934,
      "Ġadd": 935,
      "ax": 936,
      "10000": 937,
      "EEEEEEEE": 938,
      "ĠPI": 939,
      "uct": 940,
      "sizeof": 941,
      "Ġread": 942,
      "now": 943,
      "fi": 944,
      "ce": 945,
      "Ġ]": 946,
      "bound": 947,
      "ĠU": 948,
      "ost": 949,
      "[]": 950,
      "ty": 951,
      "sed": 952,
      "(-": 953,
      "========": 954,
      "//#": 955,
      "Ġpll": 956,
      "ĊĊĊĊ": 957,
      "fl": 958,
      "ĠAr": 959,
      ">&": 960,
      "output": 961,
      "14": 962,
      "hpp": 963,
      "ity": 964,
      "12": 965,
      "vis": 966,
      "ĊĠĠĠĠĊĠĠĠ": 967,
      "...)": 968,
      ";;;;": 969,
      "]++;": 970,
      "ARGS": 971,
      "oc": 972,
      "Ġpi": 973,
      "________": 974,
      "ment": 975,
      "Ġoptim": 976,
      "sse": 977,
      "are": 978,
      "uer": 979,
      "ĠĠĠĠĠĠĠĠĠĠ": 980,
      "MAXN": 981,
      "Ġ.": 982,
      "SE": 983,
      "ite": 984,
      "eck": 985,
      "ĠX": 986,
      "({": 987,
      "Ġ!": 988,
      "iterator": 989,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 990,
      "cstring": 991,
      "order": 992,
      "VA": 993,
      "Ġull": 994,
      "Ġ*/": 995,
      ",,,,": 996,
      "ĠREP": 997,
      "Ġtmp": 998,
      "âĸĴâĸĴ": 999,
      "Ġoptimize": 1000,
      "Ġtemplate": 1001,
      "ĠE": 1002,
      "Ġac": 1003,
      "act": 1004,
      ";++": 1005,
      "Ġvalue": 1006,
      "Ġsq": 1007,
      "uery": 1008,
      "ĊĊĠ": 1009,
      "OC": 1010,
      "********************************": 1011,
      "erase": 1012,
      "Ġmap": 1013,
      "20": 1014,
      "ec": 1015,
      "wap": 1016,
      "::::": 1017,
      "ĊĠĠĠĠĠĠ": 1018,
      "ction": 1019,
      "his": 1020,
      "Ġss": 1021,
      "abs": 1022,
      "]=='": 1023,
      "Ġ10000": 1024,
      "Ġ[": 1025,
      "Ġle": 1026,
      "().": 1027,
      "stdin": 1028,
      "Ġne": 1029,
      "verse": 1030,
      "Ġmul": 1031,
      "Ġii": 1032,
      "');": 1033,
      "up": 1034,
      "WWWWWWWW": 1035,
      "});": 1036,
      "Ġsizeof": 1037,
      "Ġdebug": 1038,
      ">(": 1039,
      "]){": 1040,
      "INE": 1041,
      "assert": 1042,
      "97": 1043,
      "33": 1044,
      "Ġput": 1045,
      "lib": 1046,
      "âł": 1047,
      "ont": 1048,
      "struct": 1049,
      "sort": 1050,
      ">,": 1051,
      "cerr": 1052,
      "buil": 1053,
      "rep": 1054,
      "tmp": 1055,
      "MOD": 1056,
      "empty": 1057,
      "Ġnode": 1058,
      "GGGG": 1059,
      "LINE": 1060,
      "man": 1061,
      "ĊĠĠĠĠĠĠĠĠĠ": 1062,
      "gn": 1063,
      "â£¿â£¿â£¿â£¿": 1064,
      "ep": 1065,
      "Ġthe": 1066,
      "unordered": 1067,
      "Ġvis": 1068,
      "stdlib": 1069,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1070,
      "Ġeps": 1071,
      "///": 1072,
      "update": 1073,
      "cle": 1074,
      "stat": 1075,
      "Ċĉĉĉĉĉ": 1076,
      "Ġof": 1077,
      "Ġauto": 1078,
      "Ġbu": 1079,
      "maxn": 1080,
      "DG": 1081,
      "DDDDDDDD": 1082,
      "prec": 1083,
      "time": 1084,
      "ision": 1085,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1086,
      "ok": 1087,
      "Ġsc": 1088,
      "Ġand": 1089,
      "front": 1090,
      "Ġtemp": 1091,
      "Ġlo": 1092,
      "ata": 1093,
      "<<'": 1094,
      "ĊĊĉ": 1095,
      "Ġ*=": 1096,
      "bitset": 1097,
      "atr": 1098,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1099,
      "ult": 1100,
      "WWW": 1101,
      ")-": 1102,
      "precision": 1103,
      "az": 1104,
      "Ġarg": 1105,
      "Ġ%=": 1106,
      "Ġdist": 1107,
      "Ġex": 1108,
      "â¢": 1109,
      "clo": 1110,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 1111,
      "find": 1112,
      "<<(": 1113,
      "Ġmn": 1114,
      "]={": 1115,
      "Ġend": 1116,
      "ioman": 1117,
      "iomanip": 1118,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1119,
      "24": 1120,
      "1000": 1121,
      "Int": 1122,
      "Ġadj": 1123,
      "////////////////": 1124,
      "gcd": 1125,
      ")+": 1126,
      "ore": 1127,
      "Ġ(\"": 1128,
      "mn": 1129,
      "(...)": 1130,
      "Ġabs": 1131,
      "mem": 1132,
      ">;": 1133,
      "(__": 1134,
      "58": 1135,
      "++--++--++--++--": 1136,
      "Ġacos": 1137,
      "âĸĢ": 1138,
      "Ġ^": 1139,
      "Ġ1000": 1140,
      "stdout": 1141,
      ")*": 1142,
      "EEE": 1143,
      "âķ": 1144,
      "Ġok": 1145,
      "gth": 1146,
      "unction": 1147,
      "(_": 1148,
      "Ġinclude": 1149,
      "Ġ\"<<#": 1150,
      "top": 1151,
      "JU": 1152,
      "one": 1153,
      "resize": 1154,
      "Ġdb": 1155,
      "ER": 1156,
      "break": 1157,
      "Ġlast": 1158,
      "dist": 1159,
      "<<\"\\": 1160,
      "atrix": 1161,
      "DGE": 1162,
      "mask": 1163,
      "JUDGE": 1164,
      "EB": 1165,
      "list": 1166,
      "arent": 1167,
      "its": 1168,
      "NLINE": 1169,
      "<(": 1170,
      "Ġfast": 1171,
      "Ġ';": 1172,
      "159": 1173,
      "cstdlib": 1174,
      "dex": 1175,
      "lock": 1176,
      "@@": 1177,
      "comp": 1178,
      "âĸĳâĸĳâĸĳâĸĳ": 1179,
      "rand": 1180,
      "dfs": 1181,
      ")*(": 1182,
      "AL": 1183,
      "builtin": 1184,
      "Ġostream": 1185,
      "Ġdefine": 1186,
      "ange": 1187,
      "continue": 1188,
      "pper": 1189,
      "14159": 1190,
      "ptr": 1191,
      ")<<": 1192,
      "Ġtype": 1193,
      "1415926": 1194,
      "ĠH": 1195,
      "KKK": 1196,
      "vec": 1197,
      "Ġvec": 1198,
      "par": 1199,
      "rite": 1200,
      "Ġ/=": 1201,
      "--){": 1202,
      "clock": 1203,
      "Ġcom": 1204,
      "Ġbase": 1205,
      "xx": 1206,
      "ndef": 1207,
      "||": 1208,
      "rr": 1209,
      "si": 1210,
      "Max": 1211,
      "ead": 1212,
      "name": 1213,
      "temp": 1214,
      "In": 1215,
      "ess": 1216,
      "43": 1217,
      "Ġidx": 1218,
      "Ġas": 1219,
      "gnu": 1220,
      "args": 1221,
      "22": 1222,
      "rbegin": 1223,
      "ĠONLINE": 1224,
      "Ġfl": 1225,
      "ifndef": 1226,
      "('": 1227,
      "add": 1228,
      "tag": 1229,
      "Ġcheck": 1230,
      "Ġpar": 1231,
      "this": 1232,
      "deque": 1233,
      "âĸĦ": 1234,
      "iner": 1235,
      "Ġth": 1236,
      "ab": 1237,
      "ĊĊĊ": 1238,
      "Ġhi": 1239,
      "EPS": 1240,
      "ST": 1241,
      "Ġgo": 1242,
      "Ġcomp": 1243,
      "]!=": 1244,
      "MMMMMMMM": 1245,
      "ash": 1246,
      "141592653": 1247,
      "tainer": 1248,
      "clear": 1249,
      "Ġdx": 1250,
      ">::": 1251,
      "true": 1252,
      "â¡": 1253,
      "ixed": 1254,
      "Ġvv": 1255,
      "37": 1256,
      "ĠMAXN": 1257,
      "Ġswap": 1258,
      "Ġ6": 1259,
      "Ġdy": 1260,
      "solve": 1261,
      "Ġtot": 1262,
      "88888888": 1263,
      "sstream": 1264,
      "ior": 1265,
      "Ġsh": 1266,
      "Ġff": 1267,
      "Ġfind": 1268,
      "dge": 1269,
      "ie": 1270,
      "ctime": 1271,
      "lex": 1272,
      "50": 1273,
      "ne": 1274,
      "]*": 1275,
      "UG": 1276,
      "iority": 1277,
      "SEC": 1278,
      "Ġquery": 1279,
      "Ġdi": 1280,
      "function": 1281,
      "<<\":": 1282,
      "ĠY": 1283,
      "30": 1284,
      "pl": 1285,
      "adj": 1286,
      "length": 1287,
      "Ġnow": 1288,
      "55": 1289,
      "Ġbit": 1290,
      "azy": 1291,
      "Ġ){": 1292,
      "col": 1293,
      "pbds": 1294,
      "à¦": 1295,
      "OCAL": 1296,
      "di": 1297,
      "################": 1298,
      "Ġputs": 1299,
      "istream": 1300,
      "-=": 1301,
      "Ġun": 1302,
      "AC": 1303,
      "container": 1304,
      "ink": 1305,
      "(),(": 1306,
      "tt": 1307,
      "/=": 1308,
      "fast": 1309,
      "Ġ};": 1310,
      "null": 1311,
      "00005": 1312,
      "Ġprint": 1313,
      "Ġ100": 1314,
      "ics": 1315,
      "ĠK": 1316,
      "EBUG": 1317,
      "ĊĊĠĠĠĠĠĠĠĠĠĠĠ": 1318,
      "ĠIn": 1319,
      "pow": 1320,
      "pll": 1321,
      "chr": 1322,
      "istics": 1323,
      "last": 1324,
      "cassert": 1325,
      "ber": 1326,
      "Ġ++)": 1327,
      "uti": 1328,
      "alc": 1329,
      "statistics": 1330,
      "make": 1331,
      ":.": 1332,
      "ĠEPS": 1333,
      "assoc": 1334,
      "LE": 1335,
      "av": 1336,
      "Ġcount": 1337,
      "ng": 1338,
      "IO": 1339,
      "ĠLOCAL": 1340,
      "pol": 1341,
      "]-'": 1342,
      "Ġen": 1343,
      "Ġupdate": 1344,
      "ĠĊ": 1345,
      "KKKKK": 1346,
      "Ġ{}": 1347,
      "ĠArgs": 1348,
      "Ġnext": 1349,
      "el": 1350,
      "gh": 1351,
      "=='": 1352,
      "...);": 1353,
      "16": 1354,
      "It": 1355,
      "aa": 1356,
      "operator": 1357,
      "Ġcol": 1358,
      "<<\"=": 1359,
      "Ġ9": 1360,
      "Ġï¿½ï¿½ï¿½ï¿½": 1361,
      "__)": 1362,
      "value": 1363,
      "dd": 1364,
      "left": 1365,
      "Ġargs": 1366,
      "38": 1367,
      "Ġtar": 1368,
      "row": 1369,
      "cc": 1370,
      "Ġmaxn": 1371,
      "Ġstart": 1372,
      "oot": 1373,
      "root": 1374,
      "ĠArg": 1375,
      "998": 1376,
      "14159265358": 1377,
      "=-": 1378,
      "popcount": 1379,
      "hs": 1380,
      "pt": 1381,
      "<<#": 1382,
      "ono": 1383,
      "Ġ\":": 1384,
      "rend": 1385,
      "inf": 1386,
      "polic": 1387,
      "Ġnxt": 1388,
      "sub": 1389,
      "Ġvll": 1390,
      "Ġbe": 1391,
      "ive": 1392,
      "Ġleft": 1393,
      "ĊĠĠĠĠĠĠĠĠĠĠ": 1394,
      "Ġlower": 1395,
      "]));": 1396,
      "<<\"=\"<<": 1397,
      "46": 1398,
      "lim": 1399,
      "Ġ()": 1400,
      "lli": 1401,
      "Ġparent": 1402,
      "Ġpoint": 1403,
      "Ġright": 1404,
      "eric": 1405,
      "Ġpower": 1406,
      "ĊĉĠĠĠ": 1407,
      "Ġgetchar": 1408,
      "mt": 1409,
      "Ġgr": 1410,
      "Size": 1411,
      "Ġseg": 1412,
      "Ġtarget": 1413,
      "979": 1414,
      "used": 1415,
      "Ġsqr": 1416,
      "lic": 1417,
      "functional": 1418,
      "Ġinit": 1419,
      "ĠĊĠĠĠ": 1420,
      "read": 1421,
      "]+=": 1422,
      "ĠW": 1423,
      "56": 1424,
      "99824": 1425,
      "wer": 1426,
      "ha": 1427,
      "14159265358979": 1428,
      "ype": 1429,
      "()-": 1430,
      "1111": 1431,
      "Ġind": 1432,
      "9982443": 1433,
      "Ġnew": 1434,
      "ĠQ": 1435,
      "Ġscan": 1436,
      "ME": 1437,
      "================": 1438,
      "998244353": 1439,
      "policy": 1440,
      "Ġ...": 1441,
      "FOR": 1442,
      "Ġpow": 1443,
      "iff": 1444,
      "Ġless": 1445,
      ")))": 1446,
      "},": 1447,
      "Ġforn": 1448,
      "Ġhe": 1449,
      "typeof": 1450,
      "Ġvii": 1451,
      "Ġnull": 1452,
      "Ġrb": 1453,
      "Ġ/*": 1454,
      "Ġreverse": 1455,
      "<<\"=\"<<(": 1456,
      "34": 1457,
      "tot": 1458,
      "seg": 1459,
      "31": 1460,
      "]];": 1461,
      "hild": 1462,
      "ild": 1463,
      "-'": 1464,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1465,
      "Ġusing": 1466,
      "--------------------------------": 1467,
      "lf": 1468,
      "Ġresult": 1469,
      "Ġsp": 1470,
      "expr": 1471,
      "Ġfrom": 1472,
      "ary": 1473,
      "ĠSZ": 1474,
      "ublic": 1475,
      "Ġfact": 1476,
      "UT": 1477,
      "mul": 1478,
      "Ġ->": 1479,
      "ĊĠĠĠĠĉ": 1480,
      "ero": 1481,
      "]].": 1482,
      "ation": 1483,
      "Ġused": 1484,
      "[]={": 1485,
      "inv": 1486,
      "Ġroot": 1487,
      "77": 1488,
      "Ġyou": 1489,
      "Ġpf": 1490,
      "RE": 1491,
      "numeric": 1492,
      "INT": 1493,
      "ges": 1494,
      "ique": 1495,
      "KKKKKKKKKKKKKKKK": 1496,
      "chrono": 1497,
      "next": 1498,
      "ĠIO": 1499,
      "sc": 1500,
      "Ġor": 1501,
      "com": 1502,
      "Ġpop": 1503,
      "low": 1504,
      "Ġmy": 1505,
      "(\"-": 1506,
      "ĊĉĉĊĉ": 1507,
      "fstream": 1508,
      "go": 1509,
      "Ġ>>=": 1510,
      "qu": 1511,
      "RT": 1512,
      "âĸĪâĸĪâĸĪâĸĪ": 1513,
      "Ġpriority": 1514,
      "Matrix": 1515,
      "199": 1516,
      "]--;": 1517,
      "flag": 1518,
      "Ġtest": 1519,
      "ater": 1520,
      "1415926535897932": 1521,
      "]<<\"": 1522,
      ",;": 1523,
      "Ġassert": 1524,
      "FF": 1525,
      "Ġbuild": 1526,
      "point": 1527,
      "link": 1528,
      "]))": 1529,
      "nxt": 1530,
      "Ġfixed": 1531,
      "Ġinv": 1532,
      "+(": 1533,
      "ĉĉĉ": 1534,
      "ove": 1535,
      "start": 1536,
      "]>": 1537,
      "Ġsol": 1538,
      "imes": 1539,
      "II": 1540,
      "Ġ::": 1541,
      "Ġmask": 1542,
      "01": 1543,
      "sq": 1544,
      "right": 1545,
      "orm": 1546,
      "lement": 1547,
      "Ġon": 1548,
      "Ġsub": 1549,
      "no": 1550,
      "',": 1551,
      "check": 1552,
      "nullptr": 1553,
      "lace": 1554,
      "ĊĉĠ": 1555,
      "uple": 1556,
      "fact": 1557,
      "Ġtrace": 1558,
      "Ġsqrt": 1559,
      "dis": 1560,
      "math": 1561,
      "ob": 1562,
      "reater": 1563,
      "pi": 1564,
      "%=": 1565,
      "200": 1566,
      "Ġupper": 1567,
      "ular": 1568,
      "main": 1569,
      "ĠMod": 1570,
      "ah": 1571,
      "ail": 1572,
      "aph": 1573,
      "ros": 1574,
      "141592653589793238": 1575,
      ",(": 1576,
      "data": 1577,
      "edge": 1578,
      "PER": 1579,
      ")){": 1580,
      "Ġemp": 1581,
      "Ġdep": 1582,
      "MP": 1583,
      "test": 1584,
      "Ġlcm": 1585,
      "signed": 1586,
      "Ġpq": 1587,
      "Ġrem": 1588,
      "su": 1589,
      "Ġtypedef": 1590,
      "(*": 1591,
      "Ġdis": 1592,
      "Ġdo": 1593,
      "Mod": 1594,
      "Ġ),": 1595,
      "Ġat": 1596,
      "RO": 1597,
      ",+": 1598,
      "Ġcost": 1599,
      "Ġwrite": 1600,
      "Ġvvi": 1601,
      "Ġ31": 1602,
      "+=(": 1603,
      "(\"\\": 1604,
      "Ġcan": 1605,
      "Ġ998244353": 1606,
      "Ġlow": 1607,
      "Ġflag": 1608,
      "*=": 1609,
      "14159265358979323846": 1610,
      "()){": 1611,
      "-(": 1612,
      "OCK": 1613,
      "19937": 1614,
      "LOCK": 1615,
      "Ġms": 1616,
      "gr": 1617,
      "prime": 1618,
      "]][": 1619,
      "ĠDEBUG": 1620,
      "memset": 1621,
      "Ġsetprecision": 1622,
      "IT": 1623,
      "REP": 1624,
      "puts": 1625,
      "'){": 1626,
      "Ġclock": 1627,
      "No": 1628,
      "Ġpref": 1629,
      "Ġmd": 1630,
      "79": 1631,
      "âĸĴâĸĴâĸĴâĸĴ": 1632,
      "Ġprime": 1633,
      "dig": 1634,
      "Ġpa": 1635,
      "++--++--++--++--++--++--++--++--": 1636,
      "LOCKS": 1637,
      "unique": 1638,
      "00000": 1639,
      "Ġordered": 1640,
      "iii": 1641,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1642,
      "ILE": 1643,
      "MX": 1644,
      "swap": 1645,
      "atch": 1646,
      "exp": 1647,
      "ON": 1648,
      "Ġ8": 1649,
      "[(": 1650,
      "getchar": 1651,
      "Ġsu": 1652,
      "able": 1653,
      "100005": 1654,
      "Ġuint": 1655,
      "âĸĢâĸĢ": 1656,
      "vv": 1657,
      "yy": 1658,
      "Ġed": 1659,
      "48": 1660,
      "Node": 1661,
      "ark": 1662,
      "ĊĊĊĠĠĠ": 1663,
      "ill": 1664,
      "Ġ20": 1665,
      "ited": 1666,
      "jj": 1667,
      "public": 1668,
      "tion": 1669,
      "ĠALL": 1670,
      "query": 1671,
      "index": 1672,
      "pa": 1673,
      "odd": 1674,
      "sin": 1675,
      "Point": 1676,
      "loop": 1677,
      "19": 1678,
      "Ġxx": 1679,
      "uint": 1680,
      "Ġbegin": 1681,
      "rem": 1682,
      "Ġvs": 1683,
      "heap": 1684,
      "]]++;": 1685,
      "&(": 1686,
      "******": 1687,
      "Ġup": 1688,
      "________________": 1689,
      "eger": 1690,
      "Ġque": 1691,
      "17": 1692,
      "Ġpt": 1693,
      "100000000": 1694,
      "be": 1695,
      "WK": 1696,
      "Ġiter": 1697,
      "bb": 1698,
      "Ġmulti": 1699,
      "500": 1700,
      "oo": 1701,
      "from": 1702,
      "Ġcomment": 1703,
      "Val": 1704,
      "ly": 1705,
      ",_": 1706,
      "MatrixSize": 1707,
      "har": 1708,
      "ory": 1709,
      "DE": 1710,
      "avx": 1711,
      "lity": 1712,
      "cost": 1713,
      "Ġ'<<": 1714,
      "ven": 1715,
      "Ġerr": 1716,
      "Ġpp": 1717,
      "~~": 1718,
      "Ofast": 1719,
      ")<<\",": 1720,
      "ative": 1721,
      ");++": 1722,
      "MaxMatrixSize": 1723,
      "23": 1724,
      "sh": 1725,
      "GGGGGGGG": 1726,
      "Ġbest": 1727,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1728,
      "Ġ100000": 1729,
      "Ġanswer": 1730,
      ")));": 1731,
      "linker": 1732,
      "complex": 1733,
      "ang": 1734,
      "Ġexit": 1735,
      "random": 1736,
      "arg": 1737,
      "own": 1738,
      "ach": 1739,
      "-')": 1740,
      "/**": 1741,
      "):": 1742,
      "vl": 1743,
      "Ġ(((": 1744,
      "Ġbin": 1745,
      "och": 1746,
      "per": 1747,
      "Ġpw": 1748,
      "Ġ\"/": 1749,
      "Ġke": 1750,
      "Iterator": 1751,
      "]),": 1752,
      "wo": 1753,
      "),(": 1754,
      "59": 1755,
      "////////////////////////////////": 1756,
      "write": 1757,
      "Ġdbg": 1758,
      "epoch": 1759,
      "since": 1760,
      "Ġver": 1761,
      "vel": 1762,
      "Ġrall": 1763,
      "Ġsf": 1764,
      "mark": 1765,
      "req": 1766,
      "Ġstat": 1767,
      "array": 1768,
      "curr": 1769,
      "100000": 1770,
      "@@@@": 1771,
      "utility": 1772,
      "ĠIOS": 1773,
      "acro": 1774,
      "27": 1775,
      "Ġtm": 1776,
      "Ġthis": 1777,
      "hash": 1778,
      "Ġ^=": 1779,
      "Ġcalc": 1780,
      "substr": 1781,
      "Ġ///": 1782,
      "âĸĮ": 1783,
      "Ġ\")": 1784,
      "stringstream": 1785,
      "dep": 1786,
      "]<": 1787,
      "init": 1788,
      ".....": 1789,
      "Ġ++;": 1790,
      "lower": 1791,
      "stead": 1792,
      "Ġinput": 1793,
      "Ġoo": 1794,
      "++]": 1795,
      "28": 1796,
      ">>(": 1797,
      "Ġlb": 1798,
      "Ġneed": 1799,
      "Pos": 1800,
      "Ġ30": 1801,
      "ĊĊĊĊĊĊĊĊ": 1802,
      "ĠInt": 1803,
      "ross": 1804,
      "]])": 1805,
      "lazy": 1806,
      "Ġyy": 1807,
      "Ġvl": 1808,
      "AS": 1809,
      "Ġcmp": 1810,
      "ave": 1811,
      "Ġlli": 1812,
      "Ġprev": 1813,
      "Ġdata": 1814,
      "++,": 1815,
      "iv": 1816,
      "our": 1817,
      "constexpr": 1818,
      "###": 1819,
      "Ġaa": 1820,
      "Ġno": 1821,
      "AT": 1822,
      "................................": 1823,
      "ĠPoint": 1824,
      "names": 1825,
      "Ġtl": 1826,
      "rk": 1827,
      "TES": 1828,
      "Ġrng": 1829,
      "Ġstatic": 1830,
      "co": 1831,
      "Time": 1832,
      "ĠMax": 1833,
      "Ġdel": 1834,
      "Ġ'.": 1835,
      "Ġ26": 1836,
      "Char": 1837,
      "------": 1838,
      ")==": 1839,
      "ĠPII": 1840,
      "Ġputchar": 1841,
      "memory": 1842,
      "13": 1843,
      "29": 1844,
      "Ġrhs": 1845,
      "less": 1846,
      "Case": 1847,
      "ays": 1848,
      "KKKKKKK": 1849,
      "9999": 1850,
      "steady": 1851,
      "60": 1852,
      "CRT": 1853,
      "Ġ\"]": 1854,
      "ĊĊĠĠ": 1855,
      "URE": 1856,
      "sim": 1857,
      "Ġnot": 1858,
      "mat": 1859,
      "emplace": 1860,
      "db": 1861,
      "sol": 1862,
      "Ġemplace": 1863,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1864,
      "static": 1865,
      ";.": 1866,
      "Ġ(*": 1867,
      "new": 1868,
      "Yes": 1869,
      "ms": 1870,
      "te": 1871,
      "ord": 1872,
      "Ġcurr": 1873,
      "key": 1874,
      "SECURE": 1875,
      "ĠDB": 1876,
      "__,": 1877,
      "Ġindex": 1878,
      "\".": 1879,
      "Tree": 1880,
      "âĶ": 1881,
      "Ġbig": 1882,
      "ĠPB": 1883,
      "Ġupd": 1884,
      "Ġgc": 1885,
      "ĠMP": 1886,
      "ca": 1887,
      "ance": 1888,
      "element": 1889,
      "200005": 1890,
      "erge": 1891,
      "]=(": 1892,
      "hor": 1893,
      "tf": 1894,
      "vs": 1895,
      "loat": 1896,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1897,
      "file": 1898,
      "___": 1899,
      "mi": 1900,
      "Ġlazy": 1901,
      "Ġmt": 1902,
      "Ġtime": 1903,
      "iiii": 1904,
      "Ġfill": 1905,
      "ĠĊĠĠĠĠĠĠĠ": 1906,
      "power": 1907,
      "Ġistream": 1908,
      "Ġedge": 1909,
      "Ġrange": 1910,
      "â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿": 1911,
      "Ġli": 1912,
      "âĶĢ": 1913,
      "Type": 1914,
      "Ġsi": 1915,
      "â£¿â£": 1916,
      "buf": 1917,
      "ard": 1918,
      "âķĲ": 1919,
      "pref": 1920,
      "ust": 1921,
      "Count": 1922,
      "ter": 1923,
      "sqrt": 1924,
      "tuple": 1925,
      "<=(": 1926,
      ">>=": 1927,
      "Ġnorm": 1928,
      "Ġan": 1929,
      "Edge": 1930,
      "Ġarray": 1931,
      "1010": 1932,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1933,
      "loops": 1934,
      "(;": 1935,
      "Ġinsert": 1936,
      "ALL": 1937,
      "Ġtt": 1938,
      "AN": 1939,
      "popcnt": 1940,
      "rime": 1941,
      "Ġby": 1942,
      "Ġbuf": 1943,
      "))%": 1944,
      "pq": 1945,
      "nx": 1946,
      "tex": 1947,
      ";;;;;;;;": 1948,
      "cr": 1949,
      "Ġ\"[": 1950,
      "################################": 1951,
      "Ġrev": 1952,
      ")),": 1953,
      "reverse": 1954,
      "Ġcc": 1955,
      "multi": 1956,
      "tl": 1957,
      "ĉĊ": 1958,
      "Ġmk": 1959,
      "DDD": 1960,
      "ĊĠĠĠĠĠĠĠĠĊĠĠĠĠĠĠĠ": 1961,
      "();}": 1962,
      "ĊĊĉĉ": 1963,
      "Ġfin": 1964,
      "Ġexp": 1965,
      "]]=": 1966,
      ",,,,,,,,": 1967,
      "Ġline": 1968,
      "ank": 1969,
      "md": 1970,
      "Ġps": 1971,
      "mall": 1972,
      "GGG": 1973,
      "Ġ',": 1974,
      "Ġmark": 1975,
      "âĸĦâĸĦ": 1976,
      "OF": 1977,
      "Ġco": 1978,
      "ĠMX": 1979,
      "â¢Ģ": 1980,
      "/********************************": 1981,
      "mmx": 1982,
      "roll": 1983,
      "KE": 1984,
      "ial": 1985,
      "Out": 1986,
      "SZ": 1987,
      "abm": 1988,
      "40": 1989,
      "ln": 1990,
      "digit": 1991,
      "Ġfile": 1992,
      "DDDDDDDDDDDD": 1993,
      "57": 1994,
      "Ġ(;": 1995,
      "ssse": 1996,
      "arch": 1997,
      "calc": 1998,
      "ift": 1999,
      "ET": 2000,
      "Ġ|=": 2001,
      "flush": 2002,
      "ls": 2003,
      "Ġwh": 2004,
      "Min": 2005,
      "best": 2006,
      "IZ": 2007,
      "Ġmi": 2008,
      "Ġrand": 2009,
      "Arr": 2010,
      "unroll": 2011,
      "unsigned": 2012,
      "NIN": 2013,
      "br": 2014,
      "]%": 2015,
      "Ġfore": 2016,
      "ĠFI": 2017,
      "Ġiterator": 2018,
      "ARNIN": 2019,
      "Ġnumber": 2020,
      "WARNIN": 2021,
      "Ġrr": 2022,
      "])%": 2023,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2024,
      "clim": 2025,
      "FS": 2026,
      "Ġdiff": 2027,
      "WWWWWWW": 2028,
      "WARNINGS": 2029,
      "une": 2030,
      "MMMMMMMMMMMMMMMM": 2031,
      "Ġdepth": 2032,
      "\\\\": 2033,
      "iend": 2034,
      "%%": 2035,
      "high": 2036,
      "Integer": 2037,
      "]<<": 2038,
      "fixed": 2039,
      "Ġub": 2040,
      "climits": 2041,
      "Ġpc": 2042,
      "Ġrow": 2043,
      "ĠFor": 2044,
      "ra": 2045,
      "ice": 2046,
      "limits": 2047,
      "TT": 2048,
      ">=(": 2049,
      "FILE": 2050,
      "setprecision": 2051,
      "Ġprimes": 2052,
      "Ġthrow": 2053,
      "]>=": 2054,
      "cp": 2055,
      "3456": 2056,
      ")?": 2057,
      "WWWWWW": 2058,
      "EEEEEEEEEEEE": 2059,
      "Ġ.,;": 2060,
      "EC": 2061,
      "ution": 2062,
      "://": 2063,
      "native": 2064,
      "mm": 2065,
      "OUT": 2066,
      "maxN": 2067,
      "onent": 2068,
      "!!": 2069,
      "Ġbs": 2070,
      "Ġnames": 2071,
      "AST": 2072,
      "uthor": 2073,
      "IZE": 2074,
      "ik": 2075,
      "21": 2076,
      "Ġstruct": 2077,
      "DEBUG": 2078,
      "dx": 2079,
      "**************": 2080,
      "Ġone": 2081,
      "print": 2082,
      "St": 2083,
      "Ġ');": 2084,
      "KKKKKK": 2085,
      "diff": 2086,
      "tune": 2087,
      "Ġ\"\";": 2088,
      "ĠInput": 2089,
      "âłĢ": 2090,
      "sible": 2091,
      "00010": 2092,
      "Line": 2093,
      "Ġneg": 2094,
      "<<'\\": 2095,
      "Ġrt": 2096,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2097,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2098,
      "Ġhigh": 2099,
      "Ġgraph": 2100,
      "=\"": 2101,
      "Ġ32": 2102,
      "Ġedges": 2103,
      "]<=": 2104,
      "Ġ{-": 2105,
      "Ġper": 2106,
      "âĸĲ": 2107,
      "111": 2108,
      "head": 2109,
      "uff": 2110,
      "forn": 2111,
      "child": 2112,
      "Ġ(__": 2113,
      "Ġzero": 2114,
      "flow": 2115,
      "101": 2116,
      "by": 2117,
      "Ġare": 2118,
      "ctype": 2119,
      "use": 2120,
      "NU": 2121,
      "Ġbb": 2122,
      "ĠCLOCKS": 2123,
      "264": 2124,
      ":::": 2125,
      "result": 2126,
      "ĠĊĉ": 2127,
      "Ġal": 2128,
      "Ġ100005": 2129,
      "47": 2130,
      "89": 2131,
      "fj": 2132,
      "der": 2133,
      ",\"": 2134,
      "prev": 2135,
      "kk": 2136,
      "parent": 2137,
      "ĠVI": 2138,
      "Ġ(\"%": 2139,
      "Ġcomma": 2140,
      "NN": 2141,
      "ĠINT": 2142,
      "itr": 2143,
      "Ġsync": 2144,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2145,
      "ONG": 2146,
      "Ġta": 2147,
      "()))": 2148,
      "rc": 2149,
      "ION": 2150,
      "Ġ~": 2151,
      "Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½": 2152,
      "Ġwith": 2153,
      "ACK": 2154,
      ",.": 2155,
      "debug": 2156,
      "Ġrd": 2157,
      "Ġtotal": 2158,
      "Ġ.:": 2159,
      "build": 2160,
      "Ġdeb": 2161,
      "iter": 2162,
      ";--": 2163,
      "deg": 2164,
      "cy": 2165,
      "ĠZ": 2166,
      "Ġgen": 2167,
      "Ġ\"(\"": 2168,
      "à§": 2169,
      "Ġgreater": 2170,
      "']": 2171,
      "25": 2172,
      "'||": 2173,
      "Ġ\"%": 2174,
      "Ġqueue": 2175,
      "OG": 2176,
      "WKK": 2177,
      "action": 2178,
      "PB": 2179,
      "ĊĠĊĠ": 2180,
      "Ġhash": 2181,
      "Ġ1000000000": 2182,
      "14159265358979323846264": 2183,
      "]='": 2184,
      "âķ¬": 2185,
      "log": 2186,
      "af": 2187,
      "big": 2188,
      "Ġsm": 2189,
      "Ġ'-')": 2190,
      "STACK": 2191,
      "obj": 2192,
      "rb": 2193,
      "000000": 2194,
      "Ġmodular": 2195,
      "Ġloop": 2196,
      "fac": 2197,
      "Ġoutput": 2198,
      "67": 2199,
      "ask": 2200,
      "!=(": 2201,
      "));}": 2202,
      "--,": 2203,
      "rint": 2204,
      "(\"\");": 2205,
      "ĠPR": 2206,
      "'s": 2207,
      "<<-": 2208,
      "(\"%.": 2209,
      "#####": 2210,
      "AME": 2211,
      "po": 2212,
      "ope": 2213,
      "49": 2214,
      "DEEEE": 2215,
      "ces": 2216,
      "Ġlim": 2217,
      "Value": 2218,
      "*-": 2219,
      "Ġscani": 2220,
      "ry": 2221,
      "ux": 2222,
      "Ġel": 2223,
      "ĊĠĠĠĠĊĠĠĠĠ": 2224,
      "Ġnormal": 2225,
      "Ċĉĉĉĉĉĉ": 2226,
      "â¢¿": 2227,
      "âĶĢâĶĢ": 2228,
      ")]": 2229,
      "rs": 2230,
      "Ġwe": 2231,
      "105": 2232,
      ",:": 2233,
      "['": 2234,
      "ĊĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2235,
      "acos": 2236,
      "Ġclr": 2237,
      "Ġcomplex": 2238,
      "Ġbfs": 2239,
      "8888888888888888": 2240,
      "(#": 2241,
      "Ġhell": 2242,
      "ĊĠĠĠĠĉĉ": 2243,
      "Ġbo": 2244,
      "maxi": 2245,
      "Ġdeg": 2246,
      "popcountll": 2247,
      "ain": 2248,
      "Ġoth": 2249,
      "Ġpath": 2250,
      "WWWWWWWWW": 2251,
      "Range": 2252,
      "priority": 2253,
      "1415926535897932384626433": 2254,
      "\"\"": 2255,
      "ud": 2256,
      "ĠNode": 2257,
      "ded": 2258,
      "enter": 2259,
      "Ġ-*-": 2260,
      "Ġext": 2261,
      "visited": 2262,
      "ny": 2263,
      "ĠJ": 2264,
      "ĊĠĊĠĠĠ": 2265,
      "blem": 2266,
      "80": 2267,
      "ri": 2268,
      "Ġvpii": 2269,
      "Ġ>::": 2270,
      "âĸĵ": 2271,
      "ire": 2272,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2273,
      "Ġodd": 2274,
      "ors": 2275,
      "fa": 2276,
      ")<<\"": 2277,
      "Str": 2278,
      "Ġ(_": 2279,
      "Ġct": 2280,
      "Ġmat": 2281,
      "upper": 2282,
      "Ġ\"-": 2283,
      "]],": 2284,
      "greater": 2285,
      "Ġeb": 2286,
      "Long": 2287,
      "neg": 2288,
      "Ġcase": 2289,
      "......": 2290,
      "123": 2291,
      "tc": 2292,
      "PII": 2293,
      "âķ¬âķ¬": 2294,
      "[](": 2295,
      "ED": 2296,
      "Ġmacro": 2297,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2298,
      "OW": 2299,
      "rev": 2300,
      ")((": 2301,
      "derr": 2302,
      "Ġmaxi": 2303,
      "Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½": 2304,
      "ND": 2305,
      "ðŁ": 2306,
      "âĸĳâĸĳâĸĳ": 2307,
      "Iter": 2308,
      "ump": 2309,
      "bo": 2310,
      "Ġchk": 2311,
      "NAME": 2312,
      "âĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳ": 2313,
      "ek": 2314,
      "mon": 2315,
      "**/": 2316,
      "cept": 2317,
      "****************************************************************": 2318,
      "do": 2319,
      "Ġtop": 2320,
      ")&": 2321,
      "rg": 2322,
      "_(": 2323,
      "}}": 2324,
      "();++": 2325,
      "âłĢâłĢ": 2326,
      "pro": 2327,
      "ant": 2328,
      "ai": 2329,
      "aken": 2330,
      "::::::::": 2331,
      "54": 2332,
      "path": 2333,
      "000000000": 2334,
      "bl": 2335,
      "__;": 2336,
      "qual": 2337,
      "66": 2338,
      "LI": 2339,
      "sm": 2340,
      "upd": 2341,
      "Ġà¦": 2342,
      "Ġhtt": 2343,
      "Ġbr": 2344,
      "Ġme": 2345,
      "()),": 2346,
      "edges": 2347,
      "ĠPT": 2348,
      "Ġpl": 2349,
      "ition": 2350,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2351,
      "&...": 2352,
      "NOTES": 2353,
      "Input": 2354,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉ": 2355,
      "fin": 2356,
      "sy": 2357,
      "rent": 2358,
      "Ġ11": 2359,
      "Ġvc": 2360,
      "umber": 2361,
      "1005": 2362,
      ")<<\"\\": 2363,
      "Ġorder": 2364,
      "Ġ][": 2365,
      "old": 2366,
      ",,,": 2367,
      "namespace": 2368,
      "ACRO": 2369,
      "EM": 2370,
      "unc": 2371,
      "ĠSQ": 2372,
      "Ġunordered": 2373,
      "tm": 2374,
      "Ġdig": 2375,
      "ivate": 2376,
      "Ġ')": 2377,
      "Ġhead": 2378,
      "Ġshift": 2379,
      "CT": 2380,
      "XX": 2381,
      "pw": 2382,
      "}\";": 2383,
      "Ġnl": 2384,
      "]]);": 2385,
      "Ġ\"]\";": 2386,
      "14159265358979323846264338": 2387,
      "cctype": 2388,
      "nod": 2389,
      "Ġcross": 2390,
      "Ġacc": 2391,
      "34567": 2392,
      "Ġother": 2393,
      ";;;": 2394,
      "Ġkey": 2395,
      "()==": 2396,
      "arry": 2397,
      "onoid": 2398,
      "ĠComp": 2399,
      "cmp": 2400,
      "Ġ`": 2401,
      "Ġmerge": 2402,
      "PI": 2403,
      "we": 2404,
      "tail": 2405,
      "isdigit": 2406,
      "ara": 2407,
      "ute": 2408,
      "here": 2409,
      "Ġfac": 2410,
      "Ġfabs": 2411,
      "ho": 2412,
      "ĠFAST": 2413,
      "multiset": 2414,
      "/(": 2415,
      "Ġfo": 2416,
      "Ġsec": 2417,
      "float": 2418,
      "ĠPrint": 2419,
      "my": 2420,
      "Ġ];": 2421,
      "--------------": 2422,
      "1000000007": 2423,
      "Ġ\"[\";": 2424,
      "raction": 2425,
      "Ġtc": 2426,
      "........................": 2427,
      "Ġvisited": 2428,
      "ies": 2429,
      "Ġbinary": 2430,
      "Ġ--------------------------------": 2431,
      "Ġpdd": 2432,
      "Ġmultiset": 2433,
      "Ġ12": 2434,
      "39": 2435,
      "search": 2436,
      "61": 2437,
      "Ġfriend": 2438,
      ")<": 2439,
      "imer": 2440,
      "oth": 2441,
      "EK": 2442,
      "cs": 2443,
      "ear": 2444,
      "WWWWW": 2445,
      "ĠLINF": 2446,
      "Ġmodul": 2447,
      ")>>": 2448,
      "Ġgood": 2449,
      "==-": 2450,
      "TS": 2451,
      "Ġrnd": 2452,
      "ĠMin": 2453,
      "[++": 2454,
      "Ġbound": 2455,
      "UN": 2456,
      "Ġ\")\";": 2457,
      "Ġ<<\"": 2458,
      "exit": 2459,
      "jk": 2460,
      "Ġcy": 2461,
      "Ġ&_": 2462,
      "hite": 2463,
      "wt": 2464,
      "Ġcont": 2465,
      "clz": 2466,
      "100010": 2467,
      "rest": 2468,
      "0000000000": 2469,
      "'\\": 2470,
      "Ġvar": 2471,
      "ĠLD": 2472,
      "df": 2473,
      "Ġfn": 2474,
      "disp": 2475,
      "âķĲâķ": 2476,
      "1415926535897932384626433832": 2477,
      "ww": 2478,
      "ĠÐ": 2479,
      "del": 2480,
      "Ġlst": 2481,
      "â¡¿": 2482,
      "Ġdd": 2483,
      "ĊĠĠĊĠ": 2484,
      "cpp": 2485,
      "nn": 2486,
      "1000000": 2487,
      "Ġlevel": 2488,
      "bad": 2489,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2490,
      "ĠVector": 2491,
      "EEEEEEEEEEEEEEEE": 2492,
      "bj": 2493,
      "20000": 2494,
      "_|": 2495,
      "Ġnd": 2496,
      "mag": 2497,
      "atcher": 2498,
      "Ans": 2499,
      "Ġloc": 2500,
      "Ġnx": 2501,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2502,
      "pha": 2503,
      "color": 2504,
      "================================": 2505,
      "case": 2506,
      "Ġ].": 2507,
      "68": 2508,
      "ĠĊĠ": 2509,
      "Ġwas": 2510,
      "need": 2511,
      "iple": 2512,
      "dispatcher": 2513,
      "&]": 2514,
      "ĠMEM": 2515,
